{
  "doi": "10.1016/s0891-5849(00)00317-8",
  "title": "Mitochondrial free radical generation, oxidative stress, and aging11This article is dedicated to the memory of our dear friend, colleague, and mentor Lars Ernster (1920–1998), in gratitude for all he gave to us.",
  "abstract": "Mitochondria have been described as \"the powerhouses of the cell\" because they link the energy-releasing activities of electron transport and proton pumping with the energy conserving process of oxidative phosphorylation, to harness the value of foods in the form of ATP. Such energetic processes are not without dangers, however, and the electron transport chain has proved to be somewhat \"leaky.\" Such side reactions of the mitochondrial electron transport chain with molecular oxygen directly generate the superoxide anion radical (O2*-), which dismutates to form hydrogen peroxide (H2O2), which can further react to form the hydroxyl radical (HO*). In addition to these toxic electron transport chain reactions of the inner mitochondrial membrane, the mitochondrial outer membrane enzyme monoamine oxidase catalyzes the oxidative deamination of biogenic amines and is a quantitatively large source of H2O2 that contributes to an increase in the steady state concentrations of reactive species within both the mitochondrial matrix and cytosol. In this article we review the mitochondrial rates of production and steady state levels of these reactive oxygen species. Reactive oxygen species generated by mitochondria, or from other sites within or outside the cell, cause damage to mitochondrial components and initiate degradative processes. Such toxic reactions contribute significantly to the aging process and form the central dogma of \"The Free Radical Theory of Aging.\" In this article we review current understandings of mitochondrial DNA, RNA, and protein modifications by oxidative stress and the enzymatic removal of oxidatively damaged products by nucleases and proteases. The possible contributions of mitochondrial oxidative polynucleotide and protein turnover to apoptosis and aging are explored.",
  "full_text": {},
  "mesh_terms": [
    "Animals",
    "Apoptosis",
    "Cellular Senescence",
    "DNA Damage",
    "Electron Transport",
    "Free Radicals",
    "Glutathione",
    "Hydrogen Peroxide",
    "Mitochondria",
    "Oxidants",
    "Oxidative Stress",
    "Reactive Oxygen Species"
  ],
  "keywords": [],
  "citation_count": 2345,
  "authors": [
    {
      "name": "Enrique Cadenas",
      "affiliations": []
    },
    {
      "name": "Kelvin J.A. Davies",
      "affiliations": []
    }
  ],
  "year": 2000,
  "journal": "Free Radical Biology and Medicine",
  "pmid": "11035250",
  "pmcid": null,
  "collection_date": "2025-10-11"
}