{
  "doi": "10.1089/rej.2011.1162",
  "title": "Developmental Theory of Aging Revisited: Focus on Causal and Mechanistic Links Between Development and Senescence",
  "abstract": "Senescence violates the most basic tenet of natural selection by causing death rather than individual survival. Thus, current theories favor the concept of antagonistic pleiotropy (AP) to explain how aging emerged in metazoans. Presumably, pleiotropic genes reduce vigor and limit longevity in adults. However, they also promote fitness and reproduction in juveniles, causing them to be selected and retained in the gene pool. The general hypothesis presented herein is a special case of AP that identifies the common cause and mechanism of aging in iteroparous (i.e., capable of reproducing multiple times) animals. It ascribes senescence to unremitting, nonprogrammed change or remodeling forced upon the adult soma by postmaturation expression of developmental gene(s) affecting dynamic transformation of the single-celled conceptus into a complex, multicellular organism. Whereas persistent somatic change is necessary for development to proceed normally, it also has the potential to erode homeostasis in adults after maturation is complete. Thus, developmental inertia is the primary cause of senescence, whereas decay of internal order and integrated function among interdependent systems of the body is the general mechanism by which aging progresses over time. Accordingly, this global pathogenic process creates an environment in which the many recognized, age-associated physiologic and metabolic sequelae can arise as consequences of senescence rather than causes of it. Paradoxically, the genes that promote somatic remodeling essential for development and survival also guarantee aging and death by the same action whose outcomes differ only by the time it is expressed relevant to maturation.",
  "full_text": {},
  "mesh_terms": [
    "Aging",
    "Animals",
    "Humans",
    "Longevity",
    "Models, Biological",
    "Reproduction",
    "Time Factors"
  ],
  "keywords": [],
  "citation_count": 23,
  "authors": [
    {
      "name": "Richard F. Walker",
      "affiliations": [
        "Renew BioSciences, LLC, Indian Rocks Beach, Florida."
      ]
    }
  ],
  "year": 2011,
  "journal": "Rejuvenation Research",
  "pmid": "21767161",
  "pmcid": null,
  "collection_date": "2025-10-15"
}