{
  "doi": "10.1016/j.exger.2010.09.007",
  "title": "The reproductive-cell cycle theory of aging: An update",
  "abstract": "The Reproductive-Cell Cycle Theory posits that the hormones that regulate reproduction act in an antagonistic pleiotrophic manner to control aging via cell cycle signaling; promoting growth and development early in life in order to achieve reproduction, but later in life, in a futile attempt to maintain reproduction, become dysregulated and drive senescence. Since reproduction is the most important function of an organism from the perspective of the survival of the species, if reproductive-cell cycle signaling factors determine the rate of growth, determine the rate of development, determine the rate of reproduction, and determine the rate of senescence, then by definition they determine the rate of aging and thus lifespan. The theory is able to explain: 1) the simultaneous regulation of the rate of aging and reproduction as evidenced by the fact that environmental conditions and experimental interventions known to extend longevity are associated with decreased reproductive-cell cycle signaling factors, thereby slowing aging and preserving fertility in a hostile reproductive environment; 2) two phenomena that are closely related to species lifespan-the rate of growth and development and the ultimate size of the animal; 3). the apparent paradox that size is directly proportional to lifespan and inversely proportional to fertility between species but vice versa within a species; 4). how differing rates of reproduction between species is associated with differences in their lifespan; 5). why we develop aging-related diseases; and 6). an evolutionarily credible reason for why and how aging occurs-these hormones act in an antagonistic pleiotrophic manner via cell cycle signaling; promoting growth and development early in life in order to achieve reproduction, but later in life, in a futile attempt to maintain reproduction, become dysregulated and drive senescence (dyosis). In essence, the Reproductive-Cell Cycle Theory can explain aging in all sexually reproductive life forms.",
  "full_text": {},
  "mesh_terms": [
    "Aging",
    "Animals",
    "Cell Cycle",
    "Cell Death",
    "Cell Differentiation",
    "Gonadal Hormones",
    "Humans",
    "Hypothalamic Hormones",
    "Hypothalamo-Hypophyseal System",
    "Pituitary Hormones",
    "Reproduction"
  ],
  "keywords": [],
  "citation_count": 46,
  "authors": [
    {
      "name": "Craig S. Atwood",
      "affiliations": []
    },
    {
      "name": "Richard L. Bowen",
      "affiliations": []
    }
  ],
  "year": 2011,
  "journal": "Experimental Gerontology",
  "pmid": "20851172",
  "pmcid": null,
  "collection_date": "2025-10-09"
}