{
  "doi": "10.1080/15384101.2022.2054636",
  "title": "Cell senescence, rapamycin and hyperfunction theory of aging",
  "abstract": "A hallmark of cellular senescence is proliferation-like activity of growth-promoting pathways (such as mTOR and MAPK) in non-proliferating cells. When the cell cycle is arrested, these pathways convert arrest to senescence (geroconversion), rendering cells hypertrophic, beta-Gal-positive and hyperfunctional. The senescence-associated secretory phenotype (SASP) is one of the numerous hyperfunctions. Figuratively, geroconversion is a continuation of growth in non-proliferating cells. Rapamycin, a reversible inhibitor of growth, slows down mTOR-driven geroconversion. Developed two decades ago, this model had accurately predicted that rapamycin must extend life span of animals. However, the notion that senescent cells directly cause organismal aging is oversimplified. Senescent cells contribute to organismal aging but are not strictly required. Cell senescence and organismal aging can be linked indirectly via the same underlying cause, namely hyperfunctional signaling pathways such as mTOR.",
  "full_text": {
    "Preface": "The activity of mitogen-activated and growth-promoting pathways such as PI3K/mTOR and ERK/MAPK is unremarkable in senescent cells compared to proliferating cells. But this seemingly “unremarkable” lack of the difference is remarkable in and of itself: proliferation-like activity of growth-promoting pathways in non-proliferating cells [1]. But why should we compare apples and oranges? The most relevant counterpart to senescence is quiescence: cells are arrested but not senescent (most cells in the organism). In such a comparison, a difference emerges: the activity of growth-promoting pathways, such as mTOR and MAPK pathways, is high in senescent cells, as if senescent cells proliferate. However, they do not.\n\nThere are many paradoxes in the field of cell senescence. For example, as we will discuss later, hyperfunctional mitogenic signaling (MEK/ERK/MAPK) can cause senescence instead of accelerated proliferation [2–7]. In addition, forced activation of the cell cycle in quiescent cells may lead to apoptosis, also instead of proliferation [7].\n\nSeemingly paradoxically, all known anti-aging interventions in animals from nutrient restriction to rapamycin (an mTOR inhibitor) can slow down cell proliferation.\n\nHow and why does rapamycin inhibit cell proliferation but maintains proliferative potential in the arrested cells?\n\nAlso, discussed here is the notion that senescent cells contribute to age-related diseases, but are not required. In the organism, senescent cells are a subset of gerogenic cells, which do not look like senescent cells. Finally, this article attempts to link cell senescence and organismal aging.\n\n",
    "Conventional view on cell senescence is inadequate": "For most scientists, the term “cellular senescence” means irreversible cell cycle arrest or, more precisely, permanent loss of proliferative potential. This is known as the Golden Marker of cell senescence. However, all attempts to link cell cycle arrest to organismal aging have not been successful. The oldest people and animals do not die from bone marrow failure or intestinal atrophy due to cessation of cell proliferation. In contrast, aging is associated with hyper-proliferative conditions such as cancer and leukemia, organ hypertrophy (e.g. prostate and heart hypertrophy), atherosclerotic plaques, tissue fibrosis, obesity, and others.\n\nFor example, myocardial infarction, a common cause of death in humans, is caused by neither cell cycle arrest nor DNA damage. It is cell growth and excessive functions (hyperfunction) that, via multiple steps, lead to atherosclerosis, hypertension, vasoconstriction and thrombosis, culminating in myocardial infarction.\n\nIncreasingly, despite the definition, the link between cell senescence and organismal aging becomes viewed via SASP or hyper-inflammatory phenotype of senescent cells [8–18]. This is a step in the right direction, but still insufficient. SASP is a typical hyper-function (secretion is a normal function of many cell types), but it is not the only one. Most functions are tissue-specific. For example, functions of blood platelets are adhesion and aggregation, for macrophages – phagocytosis, including phagocytosis of oxidized LDL. Hyperfunction of arterial smooth muscle cells (SMC) results in cell hypertrophy, vessel stiffness, and vasoconstriction, which all contribute to hypertension (systemic hyperfunction) and atherosclerosis (see Ref. [19]) (of note, beta-Gal staining is a marker of hyperfunctional lysosomes [20,21] and both increased p16 and beta-Gal staining are markers of hyperfunctional macrophages [22–24]).\n\nAlso to be discussed is the seemingly paradoxical notion that despite permanent loss of proliferative potential, senescence is not a form of arrest, it is a form of growth [25]. Cell senescence cannot be understood without the concept of geroconversion – a conversion from non-senescence to senescence or a continuation of growth, when actual growth is completed [1,25]. Let us start from the beginning.\n\n",
    "Proliferation, quiescence and senescence in cell culture": "Proliferation:\n\nIn cell culture, growth factors (GF) and nutrients stimulate growth-promoting pathways such as MEK/MAPK and PI3K/mTOR (Figure 1a). These pathways stimulate cellular mass growth and induce cyclin D1, which initiates cell cycle progression. Mass growth is balanced by cell division [1].\nFigure 1.Representation of proliferation, quiescence and senescence.A: Proliferation. Growth Signaling or Growth Stimulation (GS) via growth-promoting pathways (PI3K/mTOR; ERK/MAPK) stimulates cellular mass growth and activates cell cycle. Cells progress to mitosis and divide. Thus, cellular mass growth is balanced by cell division. B: Quiescence (Q). In the absence of GS cells, mTOR and MAPK are deactivated, and the cell cycle is put on hold. Cells neither grow nor cycle. In normal cell culture, quiescence can be caused by serum/GFs withdrawal, contact inhibition, anoxia and nutrient-restriction. C: Senescence (S). When the cell cycle is blocked by p21 or p16, growth signaling drives senescence instead of proliferation.\n\nQuiescence:\n\nIn the absence of growth stimulation, MAPK and mTOR are deactivated, cyclins are not induced, the cell cycle slows down and cells stop proliferating – a condition known as quiescence (Q) (Figure 1b). In this state, cells neither grow in size nor cycle. Quiescent cells are small and metabolic processes are downregulated. In cell culture, quiescence can be caused by withdrawal of serum, growth factors and nutrients, thus deactivating MAPK and mTOR and causing, in turn, cell cycle arrest [1]. (Note: Some cancer cells tend to die rather than become quiescent for the reason discussed in the last section.) Quiescence is reversible by growth stimulation, such as the readdition of growth factors or serum.\n\nContact inhibition also causes quiescence [26]. In contact-inhibited cells, MAPK and mTOR pathways are deactivated, halting both cell mass growth and cell cycle (26). Splitting contact-inhibited cells into a lower density culture re-activates MAPK and mTOR pathways and releases the cell cycle. The cells then re-start proliferation.\n\nSenescence:\n\nOnce again, in quiescence, cell cycle arrest is caused by the deactivation of growth-promoting (MAPK, mTOR, etc.) pathways. However, the cell cycle can be blocked directly by induction of p21 and p16, which in turn can be induced by numerous stressors (Figure 1c). When the cell cycle is blocked in such a manner, mTOR and MAPK remain fully activated, driving unbalanced growth without inducing division and cyclins D. This induction is futile, however, because the cell cycle is blocked by p21 and p16. The cell is frozen in a hypermitogenic state [1]. Cells have a large and flat morphology and are hyperactive and hyperfunctional (e.g, SA-beta-Gal staining is lysosomal hyperfunction and SASP is secretory hyperfunction).\n\nThus, a combination of molecular markers of senescence is as follows: p16 and p21 (markers of cell cycle block) plus phospho-S6 (a convenient marker of mTOR activity) and cyclin D1 (a marker of overstimulation (1).\n\nFiguratively, geroconversion is “twisted” growth when actual growth is completed [1,25,27]. mTOR drives geroconversion, rendering cells hypertrophic and hyperfunctional (e.g. SASP) and thus leading eventually to age-related pathologies [27–29].\n\n",
    "The car analogy: push brake and gas at the same time": "When a driver pushes the gas pedal (analogous to growth stimulation), the car drives. This is proliferation (Figure 1a). When the gas pedal is released, the car slows down and stops (Figure 1b). This is a reversible quiescence. In cell senescence, the cell cycle is blocked by powerful brakes, such as p16 and/or p21, in the presence of growth stimulation (Figure 1c). In this senescence analogy, the brakes and accelerator are pushed simultaneously. Eventually, the car will be out of order. This analogy is applicable not only to cellular senescence but also to organismal aging [30].\n\n",
    "The clogged sink analogy": "Senescent cells can be damaging to the organism. This is not molecular damage but organ damage and mostly to the distant organs. Consider the clogged sink analogy (Figure 2). In proliferation, the water comes into the sink and gets out. If you close the faucet, water does not come at all (quiescence) and the sink is empty, as well. However, if the sink is clogged and the faucet is still turned on (cell senescence), then the problem arises. The water overflows the sink and may damage distant objects, such as a laptop on the floor. Similarly, hyperfunctional cells in the arterial walls, liver, adipose tissue, and the hematopoietic system can eventually cause atherosclerosis and thrombosis, leading to a stroke, damaging the brain.\nFigure 2.The clogged sink analogy for proliferation, quiescence and senescence.P: Proliferation. Unrestricted flow of the water (blue) to the sink and out. Q: Quiescence. The faucet is closed (red). The sink is empty. S: Senescence. The faucet is opened (red), but the sink is clogged. The sink is full of water, causing outflows and damage to the distant objects (organs).\n\n",
    "From the model of geroconversion to the hyperfunction theory": "The hyperfunction theory is a translation of the rules of geroconversion to organismal aging [31].\n\nGeroconversion is the continuation of a growth program when actual growth is restricted by cell cycle arrest. Geroconversion is a quasi-program of growth (Figure 3). Organismal aging is a continuation of developmental growth, when actual growth is completed. Aging is a quasi-program of developmental growth [27,31–37].\nFigure 3.Geroconversion is a form of “twisted” growth.P: Proliferation. Cells grow in size and divide. S: Senescence. Geroconversion is a continuation of growth when the cell cycle is blocked by p21/p16.\n\nBoth geroconversion and organismal aging are driven in part by the mTOR pathway (Figure 4). Like cell senescence, organismal aging is primarily associated with hypertrophy and hyperfunction that eventually lead to diseases of aging, organ damage and secondary loss of function. Examples of organismal hyperfunctions include hypertension, hyperglycemia, hyperlipidemia, hyperinsulinemia, hypercoagulation, prostate hypertrophy autoimmunity, osteoarthritis and early stages of all diseases. Hyperfunctions eventually lead to organ and system damage and loss of functions [27]. This creates the illusion that aging is primarily functional decline. Since it is more difficult to restore function than to suppress hyperfunctions, rapamycin should be most effective before organ damage occurs [27].\nFigure 4.The analogy between cell senescence and organismal aging.Both geroconversion and aging can be depicted as a continuation of growth. Rapamycin, gerostatic, slows down growth (cytostatic), geroconversion and aging\n\n",
    "Oversimplified model of cellular senescence in organismal aging": "Figure 5a exemplifies a conventional and oversimplified model linking cellular senescence to organismal aging:\nFigure 5.Linking cell senescence to organismal aging.A. Oversimplified model. Cell senescence causes organismal aging (and age-related diseases) via SASP. B. Comprehensive model. Fully senescent cells contribute but are not absolutely required for aging (and age-related diseases) C.The common cause model. The link between senescence and aging is mostly indirect, by sharing the same signaling pathways that drive both geroconversion in cell culture and organismal aging (and age-related diseases). Senescent cells contribute but are not absolutely required.\n\nSenescent cells-SASP-Aging (Figure 5a).\n\nHowever, this simple schema (Senescent cells-SASP-Aging) cannot substitute the complex pathogenesis of age-related diseases, involving multiple cell types and different hyperfunctions. All achievements of biomedical sciences should not be thrown away.\n\nNotably, SASP is just one of the numerous cellular hyperfunctions, and its suppression may not always be sufficient for life extension. For example, glucocorticoids (corticosterone and cortisol) inhibit SASP [12]; however, glucocorticoids do not extend life span. In contrast, very high levels of glucocorticoids in untreated Cushing’s disease are associated with a poor prognosis; the median survival is about five years [38].\n\n",
    "From an oversimplified model to hyperfunctional model": "Let us return to the example of myocardial infarction. The atherosclerotic plaque consists of hypertrophic and hyperplastic SMC, hyperfunctional macrophages (foam cells), and calcification and lipid accumulation by foam cells. Hyperfunctional (activated) endothelial cells attract hyperfunctional blood platelets with a higher propensity to adhere and aggregate. Atherosclerosis, hypercoagulation, platelet overactivation, and hypertension myocardial hypertrophy all together may lead to myocardial infarction.\n\nAccording to the hyperfunction theory, the sequence of events is:\n\nConstitutively active signaling pathways (in the absence of growth) – geroconversion – Hyperfunctional gerogenic cells (including a few senescent cells) – Tissue-specific hyperfunctions (including SASP) – Age-related diseases, whose sum is aging (Figure 5b).\n\nIn the organism, geroconversion creates a few senescent cells but makes all cells hyperfunctional (gerogenic), causing age-related diseases – which are deadly manifestations of aging. More generally, senescent cells may contribute to organismal aging but are not required. Even this model is not sufficient to fully understand the link between cellular senescence and organismal aging.\n\n",
    "The ultimate hyperfunction model": "According to the view, cell senescence may or may not be involved in organismal aging. In this scenario, both cell senescence and organismal aging result from hyperfunction by the same signal-transduction pathways such as mTOR, without a necessarily causative link (Figure 5 C). More on this in the last section: “The origin of the hyperfunction theory: personal perspective.”\n\nConsider analogy. What is the link between yeast aging and organismal aging? There is no direct link. Our body is not built of yeast cells. Yeast aging and our aging are linked only by analogy. mTOR is involved in both yeast and organismal aging. No mechanistic link is observed. Since rapamycin slows down geroconversion, one may expect that it should slow aging and delay age-related diseases [27].\n\n",
    "How to measure the “Golden marker” of senescence: technical section": "To study geroconversion using “golden marker” (permanent loss of proliferative potential), one first needs to induce reversible arrest and then observe how it becomes irreversible over time [25,39]. The arrest should be easily switched on and off, without damaging the cell.\n\nAs described by Dr Roninson and coworkers, the HT-1080 fibrosarcoma cell line has been permanently transfected with IPTG-inducible p21 and p16 [40–42].\n\nImportantly, p21 and p16 do not cause DNA damage and do not inhibit mTOR and MEK/ERK/MAPK [25,39,43]. These CDK inhibitors just cause cell cycle arrest, which can be easily reversed by switching p21 and p16 off, by adding and removing IPTG. These cell lines are called HT-p21 and HT-p16, respectively.\n\nTo study geroconversion, these cells must be plated at low cell density to give them space to become large and flat during geroconversion (Note: High cell density inhibits geroconversion by itself [26]). The culture medium should be fresh to avoid mTOR deactivation.\n\nThe addition of IPTG to the culture medium rapidly induces super-high levels of p21 (or p16), causing cell cycle arrest in 100% of cells after 16 hours [42].\n\nWhen (after 16 hours) IPTG is removed by media change, the cells resume proliferation. So, at that time, cells are not senescent. But if IPTG is washed out (change of the media) after 3–4 days, then most cells cannot restart proliferation. While still entering the S phase of the cell cycle (because p21 and p16 are switched off), senescent cells cannot complete the cell cycle and die. This means that they lost the potential to proliferate, form colonies, regenerate cell culture, and reverse senescent morphology. Cell senescence is irreversible even when cell cycle arrest is reversible [1].\n\nThe longer the arrest before IPTG is washed out, the lower the proliferative (regenerative) potential of the cell cultures [39,44]. The same effect was observed with other reversible CDK inhibitors [44].\n\nRapamycin (when added together with IPTG) slows down geroconversion, so most cells can resume proliferation, when both IPTG and rapamycin are washed out (Note: Rapamycin should be removed because it inhibits proliferation on its own). Rapamycin slowed down geroconversion approximately 3-fold [39]. It also decreased cellular hypertrophy, which can be measured as a ratio of protein per cell and moderately decreases beta-Gal staining [45].\n\n",
    "Convenient markers of geroconversion to senescence": "IPTG and butyrate cause cell cycle arrest that can be reversed by a simple change of the media [39]. However, in many models, the method of induction of cell cycle arrest (DNA damaging drugs such as doxorubicin) results in permanent loss of the proliferative potential (PLPP) because arrest cannot be reversed by change of the media. Such models are not suitable to measure the golden marker of senescence.\n\nDuring geroconversion, cells grow in size (large morphology), express super-high levels of cyclin D1 and are characterized by beta-Gal staining (lysosomal hyperfunction) and SASP (hypersecretion).\n\nFor example, during cell cycle arrest by IPTG, the ratio of protein per cell increased exponentially for 3–4 days [45]. Rapamycin slows down exponential growth in size (decreased protein per cell ratio), which can be easily determined by measuring total protein in the well and the cell count in parallel wells. This is perhaps the best way to measure effects of gerostatics such as rapamycin. Another marker of geroconversion is a combined expression of cyclin D1 and phospho-S6 in arrested cells with p21/p16 expression [1].\n\n",
    "Gerostatics": "The concept of geroconversion allowed us to discover gerostatics (a subgroup of cytostatic drugs that slow down not only cell proliferation but also geroconversion). Rapamycin and other rapalogs are prototypical gerostatics. All gerostatics may induce cell cycle arrest on their own, but in the presence of p21/p16-induced cell cycle arrest, their gerostatic effects become apparent. For example, nutlin-3 (an Mdm-2 inhibitor and indirect p53 inducer) induces p53/p21 and reversible quiescence in HT-p21 and HT-p16 cells. But why does it not induce senescence, despite p53/p21 induction? This is because nutlin-3 simultaneously inhibits mTOR and slows down geroconversion [46]. In fact, when added to cells arrested by IPTG-inducible ectopic p21 and p16, nutlin-3 suppresses geroconversion, sustains quiescence, prevents loss of proliferative potential, and renders cells smaller and elongated instead of flat (46). Rapamycin makes cells smaller, but they are still flat (Note: in some cell lines, nutlin-3 does not sufficiently inhibit mTOR and therefore induces senescence [47]).\n\nIn agreement with our findings, the work from different laboratories demonstrated that rapamycin decreases senescent markers including SASP [5,16,48–60].\n\nInhibitors of MEK and PI3K (43), double PI3K/mTOR and pan-mTOR inhibitors [61,62] are gerostatics, which slow down proliferation and geroconversion.\n\nPan-mTOR inhibitors are even more effective than rapamycin to suppress senescent phenotype [61,62]. They are slightly superior to rapamycin (and other rapalogs) in inhibiting hypertrophy (preventing large cell morphology) and beta-Gal staining and oil red staining (fatty droplets). Unlike rapamycin, they prevent flat morphology. Their advantage is that they inhibit rapamycin-insensitive functions of mTORC1. However, pan-mTOR inhibitors are cytotoxic at higher doses [62].\n\nI suggest a combination of low doses of pan-mTOR or PI3K/mTOR inhibitors plus high doses of rapamycin (or everolimus). At low doses, these inhibitors are expected to moderately suppress mTORC1 functions without toxicity, while high doses of rapamycin may inhibit rapamycin-sensitive function profoundly also without toxicity.\n\nUnfortunately, pan-mTOR inhibitors have not yet been tested on life extension in animals. MEK inhibitor (in combination with rapamycin) was tested in Drosophila only [63]).\n\n",
    "Replicative senescence": "In specific conditions, rapamycin can also delay replicative senescence [60,64–66] and prevent senescence during cell reprogramming [67]. The mechanism is still unclear. Replicative senescence (also known as the Hayflick limit) is an ineffective method of causing cell cycle arrest, which is induced by varying mechanisms after varying number of divisions and at varying times for individual cells. Replicative senescence is an inconvenient model that has no relevance to the organism. Therefore, we will not discuss replicative senescence further.\n\n",
    "The notion of geroconversion is somewhat underappreciated": "The notion of geroconversion adds the second dimension to distinguish between senescence (S) and quiescence (Q). The second dimension reveals a reverse relationship between proliferation and geroconversion in primary normal cells (Figure 6).\nFigure 6.Two-dimensional representation of proliferation P, quiescence Q and senescence S in normal cells.Two-dimensional representation (proliferation rate vs geroconversion) distinguishes between Q and S in normal cell culture. In standard one-dimensional representation (proliferation rate), both Q and S would be just “proliferation arrest”. The model reveals reverse correlation between geroconversion and proliferation rate in normal proliferating cells.\n\nNoteworthy, geroconversion was described in the organism [68–71].\n\nDNA damage causes cell cycle arrest in the first 16 hours, but the senescent phenotype develops slowly during next 3–6 days. It is obvious there is a separate process apart from cell cycle arrest. This separate process is geroconversion. Without geroconversion, the arrested cell would be unchanged over time. Despite the obvious, the notion of geroconversion is underappreciated for several reasons:\n\n1.The confusion between proliferation and proliferative potential. Note: Rapamycin inhibits proliferation but preserves proliferative potential in non-proliferating cells.\n\n2.The confusion between irreversible cell cycle arrest and loss of proliferative potential. Note: Rapamycin does not reverse cell cycle arrest, it causes it (in the form of quiescence), but it maintains the proliferative potential in quiescent cells.\n\n3.The use of replicative senescence models is complicated by cytostatic effects of rapamycin on cellular proliferation.\n\n4.Beta-Gal staining is a marker of both senescence and quiescence caused by serum withdrawal and contact inhibition.\n\nTo study the effects of gerostatics on the golden marker, the culture model should meet several requirements:\n\na.To render arrest reversible, the inducer of cell cycle arrest at the beginning should be easily removable (e.g. by changing media). IPTG-inducible p21/p16, sodium butyrate and pharmacological CDK inhibitors are good examples. In contrast, most DNA damaging drugs, such as doxorubicin, are not removable and damage the cell.\n\nb.The inducer of cell cycle arrest should not damage the cell.\n\nc.The inducer should cause rapid arrest in all (or almost all) cells in the dish. Otherwise, non-arrested cells will take over.\nGerostatics (e.g. rapamycin) should be added simultaneously (not later) with the inducer of cell cycle arrest.\n\n",
    "The origin of hyperfunction theory: personal perspective": "Paradoxes may herald a paradigm shift. At the end of the last millennium, it was paradoxically shown that, in the absence of growth factors, forced activation of the cell cycle (e.g. by transfection with c-myc and E2F) in quiescent cells can cause apoptosis instead of proliferation [7]. This happens because growth-promoting (upstream pathways) are deactivated, but the cell cycle (downstream) is forcefully activated.\n\nSo, there are three scenarios (Figure 7): (i) growth signaling is ON and the cell cycle is ON (proliferation), (ii) growth signaling is OFF and cell cycle is OFF (quiescence), and (iii) growth signaling is OFF and cell cycle is ON (apoptosis). But what about the ON/OFF combination?\nFigure 7.Four combinations of growth and cycling: formal approach.Proliferation P, Quiescence Q and Senescence S. See text for further explanation.\n\nHere, the second paradox is helpful. In proliferating cells, strong mitogenic/growth-promoting signaling such as hyper-activated MEK, Ras, Raf and Akt can cause senescence, instead of proliferation [2–7]. Strong growth stimulation simultaneously induces cyclins and CDK inhibitors (p21, p16), thus causing cell cycle arrest because inhibitors are dominant [7].\n\nAs suggested in 2003, this condition (Growth ON/Cycle OFF) leads to cellular senescence [7] in the process later named geroconversion [72]. In fact, in the absence of cell division, growth becomes imbalanced, and cells become hypertrophic, beta-gal-positive (lysosomal hyperfunction), hypersecretory and so on. Growth factor/insulin resistance develops in compensation [7].\n\nBy 2005, numerous deactivating mutations were identified that could extend the life span of model organisms. Among them were components of the mTOR pathway. Since the same pathways are involved in cell senescence and organismal aging, the hyperfunction theory of quasi-programmed aging was developed [27]. Given that rapamycin was available for human use and mTOR was involved in most human diseases, to be useful, the theory became mTOR-centric [27].\n\n"
  },
  "mesh_terms": [
    "Aging",
    "Animals",
    "Cell Proliferation",
    "Cellular Senescence",
    "Sirolimus",
    "TOR Serine-Threonine Kinases"
  ],
  "keywords": [
    "Senescence",
    "geroconversion",
    "geroscience",
    "gerostatics",
    "healthspan",
    "rapalogs",
    "sirolimus"
  ],
  "citation_count": 45,
  "authors": [
    {
      "name": "Mikhail V. Blagosklonny",
      "affiliations": [
        "Roswell Park Comprehensive Cancer Center, Buffalo, NY, USA"
      ]
    }
  ],
  "year": 2022,
  "journal": "Cell Cycle",
  "pmid": "35358003",
  "pmcid": "PMC9278457",
  "collection_date": "2025-10-15"
}