{
  "doi": "10.26633/RPSP.2025.83",
  "title": "The voice of healthy aging for changing paradigms and changing lives: a tribute to Dr. Enrique Vega García",
  "abstract": null,
  "full_text": {
    "A VISIONARY BEYOND HIS TIME": "Dr. Vega García believed that aging was not a problem to be solved, but a natural process to be understood, embraced and supported. He persistently advocated for a shift in how we feel, think and act about aging. This belief was not merely rhetorical; it served as the foundation for his policy work, educational efforts and research. His holistic approach acknowledged the biological, psychological, social and cultural dimensions of aging: promoting active participation, autonomy and dignity for all older adults.\n\n",
    "PIONEERING CONTRIBUTIONS IN PUBLIC HEALTH, GERIATRICS AND AGING": "Dr. Vega García’s work at PAHO marked a turning point in how aging was framed within public health agendas. He led groundbreaking initiatives integrating chronic disease prevention, long-term care and healthy aging strategies across countries. Under his leadership, aging became an integral part of life-course approaches, evidence-based policies and intersectoral action. He championed the innovative use of demographic and health data to reveal the often-overlooked challenges of aging. He conducted and promoted rigorous studies of the social determinants of health in old age, the prevention and management of chronic diseases, and the quality of life of older populations. A strong advocate for translational research, he ensured that scientific knowledge was converted into practical interventions that reached those who needed them most, redefining the relationship between evidence and action in the field of aging. He was also among the first public health leaders in the Region to recognize the potentials of digital health and artificial intelligence to improve the lives of older people. He understood that technology, when used ethically and inclusively, could reduce barriers to care, support autonomy and independence, and enhance well-being in later life. His forward-looking approach helped lay the foundation for integrating digital tools into aging and health strategies across the Region of the Americas.\n\n",
    "CHANGING PARADIGMS, CHANGING LIVES": "Dr. Vega García catalyzed cultural and institutional shifts in how aging is perceived. He moved the field away from fragmented, disease-centered models towards inclusive, person-centered approaches focusing on functional ability and enabling people to do what they have reason to value. He reminded us that to serve older people well, we must create health systems, environments and societies that value their contributions, honor their stories and enable their full participation in social life. His oft-repeated phrase that “First, we need to change the way we feel, think and act about old age and aging,” stands as a call to action across the Region. It captures his most enduring legacy: the re-humanization of aging in policy, in research and in practice.\n\n",
    "HUMANITARIANISM, MENTORSHIP AND ETHICAL LEADERSHIP": "Dr. Vega García’s work was guided by a profound humanity that transcended his professional achievements. He understood aging not merely as a subject of study, but as a deeply personal and social matter. He often reminded colleagues that numbers and indicators should never eclipse the lived experiences of older people. Every initiative he led was grounded in compassion, equity and high respect for human dignity. He was a vocal advocate for the human rights of older persons and contributed to advancing Regional commitments, such as the Inter-American Convention on Protecting the Human Rights of Older Persons. His empathy extended far beyond formal settings. In a conversation with a friend who had just turned 55 and was concerned about health issues, Dr. Vega García said with characteristic clarity and warmth: “Bro, hay que entender que después de los 50 todos estamos enfermos de algo; la cosa es llevarlo bien y disfrutar al máximo la vida controlando lo que tenemos” [“Bro, we have to realize that after 50 we’re all affected by something. The thing is to manage it the best we can and enjoy life to the fullest.”].\n\nThis simple but profound reflection embodied his philosophy: accept aging with honesty, manage it with responsibility and live it with joy. He also played a key role in mentoring future generations of public health professionals. For him, capacity-building was not just about transferring knowledge, it was about modeling values: empathy, critical thinking, public service. His presence in classrooms, at conferences and in communities left an indelible mark on countless students, colleagues and collaborators.\n\n",
    "A LASTING LEGACY": "Dr. Enrique Vega García’s work continues to shape public health strategies across the Region of the Americas and beyond. His influence helped embed healthy aging into national health agendas, train thousands of professionals, and empower new generations and communities to engage with their older members with dignity and respect. His integrative vision—linking health across the life course with an ethical commitment to equity—offers a model for modern public health. He recognized that aging could not be addressed in isolation and instead wove it into broader efforts, from childhood development to chronic disease prevention, digital transformation and to human rights.\n\nThrough this work, he catalyzed intergenerational thinking and multisectoral collaboration, ensuring that the policies he championed were not only innovative but also inclusive and sustainable. His legacy is a reminder that the future of healthy aging depends on our ability to connect the dots across disciplines, generations, and systems, with foresight, empathy and unwavering respect for human dignity.\n\nDr. Vega García’s legacy teaches us that transformations in health begin with transformations in mindsets. His work was grounded in scientific excellence and ethical responsibility, driven by a vision of a world where aging is no longer synonymous with vulnerability but with opportunity. This editorial stands as a tribute and a promise: to keep alive the values he embodied, to advance the causes he championed, and to ensure that every step we take toward better healthy aging policies and practices carries his spirit—committed, courageous and compassionate.\n\nIn memory of a true leader in public health and a tireless advocate for older people: Enrique! Your voice, your values and your vision live on.\n\n"
  },
  "mesh_terms": [],
  "keywords": [],
  "citation_count": null,
  "authors": [
    {
      "name": "Sonja Caffe",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Patricia Morsch",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Carolina Hommes",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Suzanne Serruya",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "James Fitzgerald",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Ernesto Bascolo",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Ramon Martinez",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Pedro Ordunez",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Mario Cruz-Penate",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Sebastian Garcia-Saiso",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Luis Miguel Francisco Gutierrez Robledo",
      "affiliations": [
        "National Institute of Geriatrics, Mexico City, Mexico"
      ]
    },
    {
      "name": "Martha Peleaz",
      "affiliations": [
        "Association of Former PAHO Staff Members, Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Mary Lou Valdez",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "George Alleyne",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America"
      ]
    },
    {
      "name": "Marcelo D’Agostino",
      "affiliations": [
        "Pan American Health Organization (PAHO), Washington, D.C., United States of America",
        "dagostim@paho.org"
      ]
    }
  ],
  "year": 2025,
  "journal": "Revista Panamericana de Salud Pública",
  "pmid": "40625369",
  "pmcid": "PMC12232491",
  "collection_date": "2025-10-15"
}