{
  "doi": "10.5604/12321966.1129943",
  "title": "Biological psychological and social determinants of old age: Bio-psycho-social aspects of human aging",
  "abstract": "The aging of humans is a physiological and dynamic process ongoing with time. In accordance with most gerontologists' assertions it starts in the fourth decade of life and leads to death. The process of human aging is complex and individualized, occurs in the biological, psychological and social sphere. Biological aging is characterized by progressive age-changes in metabolism and physicochemical properties of cells, leading to impaired self-regulation, regeneration, and to structural changes and functional tissues and organs. It is a natural and irreversible process which can run as successful aging, typical or pathological. Biological changes that occur with age in the human body affect mood, attitude to the environment, physical condition and social activity, and designate the place of seniors in the family and society. Psychical ageing refers to human awareness and his adaptability to the ageing process. Among adaptation attitudes we can differentiate: constructive, dependence, hostile towards others and towards self attitudes. With progressed age, difficulties with adjustment to the new situation are increasing, adverse changes in the cognitive and intellectual sphere take place, perception process involutes, perceived sensations and information received is lowered, and thinking processes change. Social ageing is limited to the role of an old person is culturally conditioned and may change as customs change. Social ageing refers to how a human being perceives the ageing process and how society sees it.",
  "full_text": {},
  "mesh_terms": [
    "Adaptation, Psychological",
    "Aging",
    "Humans",
    "Motor Activity",
    "Sociological Factors"
  ],
  "keywords": [],
  "citation_count": 215,
  "authors": [
    {
      "name": "Małgorzata Dziechciaż",
      "affiliations": []
    },
    {
      "name": "Rafał Filip",
      "affiliations": []
    }
  ],
  "year": 2014,
  "journal": "Annals of Agricultural and Environmental Medicine",
  "pmid": "25528930",
  "pmcid": null,
  "collection_date": "2025-10-15"
}