{
  "doi": "10.1093/gerona/glae210",
  "title": "The Power of a Complex Systems Perspective to Elucidate Aging",
  "abstract": "It is becoming highly accepted that aging, age-related diseases, and geriatric healthcare can move forward if reductionist research is complemented by integrative research uniting knowledge on specific aging mechanisms, multiple biomedical, social, psychological, lifestyle, and environmental factors and their interactions. In this special issue, we present exciting papers that illustrate how complexity science theory and practice can be applied to aging research and provide a better understanding and quantification of healthy aging and vulnerability to disease. Recent insights on biomarkers, clocks of aging, frailty, and resilience are covered and studied in interaction with a dynamic multiscale perspective. The editorial and closing viewpoint guide you through basic principles of gerontological complexity science and shed light on new research horizons, including innovative systems-based interventions.",
  "full_text": {
    "Novel Insights": "We aim to demonstrate this potential toolbox to elucidate new patterns in aging with this small, carefully selected collection of papers. For example, we might intuitively suspect that greater network connectivity indicates greater integration of systems and therefore better health; 2 of the articles in this collection suggest exactly the opposite. Hao et al. show that, among 71 biomarkers, network connectivity (correlations among elements) is increased in frail individuals (17). Koivunen et al. show that connections among intrinsic capacity domains increase with age and declining self-reported health (23). In both cases, it appears that during aging there is a loss of appropriate compartmentalization, necessary to buffer against the potential for one failing system to drag another down, leading to and explaining the cascade dropout of organs seen in many older persons with insufficient intrinsic capacity. This is consistent with findings of system collapse in other complex systems (eg, electricity grids, and ecological food webs), where accelerating variability and cross talk precede critical transitions between system states (ie, collapse) (24). Future work should begin to assess whether these conclusions replicate in other contexts, particularly across biological scales. If supported more broadly, this would suggest that maintenance of dynamic health during aging requires a holistic approach rather than a one-mechanism-at-a-time approach: key manifestations of aging such as frailty are not likely to have a single, etiologically unique explanation or pathway, but represent rather the cumulative manifestation of multiple compromised systems interacting on different scales.\n\nLikewise, 2 articles appear to show that health depends on the maintenance of clear distinctions between physiological states to answer different contextual challenges, for example, between resting states and active responses to particular stimuli. Hong et al. examined the complexity of oxygenation and deoxygenation signals in the prefrontal cortex under different cognitive tasks, including innovative measures of complexity using neuroimaging data (21). Fast reaction time was best maintained in individuals that showed the greatest increase in complexity of both oxygenation and deoxygenation relative to baseline as task difficulty increased. Rudisch et al. examined differences in complexity of force fluctuations of manual manipulation that was either symmetric in both hands or coordinated differentially between hands, in both cognitively health individuals and those with mild cognitive impairment (20). They found more complexity in the symmetric task compared to the coordinated task, and that this difference was much more marked in cognitively healthy individuals. The traditional view is that maintenance of high complexity in biological signals is a sign of health and/or healthy aging (25); both these papers expand upon this view by showing that measures of complexity and their relation to health may depend upon the nature of the task. Health may require maintaining high complexity when appropriate, but low complexity may also be prioritized when appropriate, rather than uniformly investing in high complexity, relating to the notion of “reactive tuning” of certain systems during focused tasks (26). Although these 2 papers both deal with measures of signal complexity, we hypothesize that this finding applies more broadly: that we may not be able to arrive at broad principles for what health and healthy aging are in terms of systems dynamics, but rather that the definition of health will need to be empirical, context-dependent, and fit for evolutionary purpose.\n\nAnother notable feature of the articles in this special issue is their demonstration of the power of network analyses in domains where we might not previously have thought to apply them, particularly as regards metrics of aging. Pridham and Rutenberg applied dynamical network stability analysis to different measures of biological age and showed that a core measure of biological age, the “physiological age” proxy for cardiometabolic health, can be identified that seems to drive the others, such as epigenetic clocks (22). Koivunen et al.’s network analysis of different domains of intrinsic capacity showed changes in connectivity related to both age and self-reported health (23). Hao et al.’s analysis showed how networks of biomarker interactions relate to frailty (17). Mak et al. tested whether sequential measures of the frailty index (FI) and epigenetic clocks show bidirectional effects; most clocks showed no longitudinal association with FI whatsoever, but the DunedinPACE clock did predict subsequent FI, while the reverse was not true (16). Crucially, in most of these cases, there is not even a requirement that there be a plausible mechanistic scenario where the network involves clearly defined entities that directly interact with each other: the dynamics emerge even among abstractly defined constructs or among sparsely sampled subsets of larger networks (27), showing the robustness of such approaches.\n\nComplex systems research is sometimes perceived as abstract and therefore insufficiently mechanistic or applied. The articles in this collection demonstrate the contrary, particularly in the context of falls. Langeard et al. show how detrended fluctuation analysis, a measure of complexity, can be applied to postural and cognitive data to predict fall risk in ways that traditional analysis cannot (18). Masters and Uiga provide a creative new approach to risk mitigation during falls: the hypothesis that simple, metaphoric mnemonic cues may be effective in reducing impact during falls and thereby mitigating harm (19). This is inspired by the notion of degeneracy in complex systems: the convergence toward a similar end state (safe landing) via a multiplicity of falling dynamics. They outline a program of research to explore this hypothesis and thereby nicely illustrate how embracing the paradigm of systems thinking may also result in new therapeutic options to be studied.\n\n",
    "Toward a System of Paradigms": "The complex systems paradigm is often perceived as mathematically and methodologically challenging and therefore intimidating, and it is indeed true that several of the featured articles do use or develop cutting-edge methods. However, we believe that the key innovation to be gained from applying complex systems theory to aging research is not in the specific methods, but in the change of perspective, and the accompanying change in the questions we ask. A crosscutting characteristic of the articles featured here is that they ask questions based on an understanding of organisms as complex dynamic systems undergoing aging; in no case would a simple, reductionist perspective have yielded these questions or the insights from the resultant papers. Once the proper question is identified, the methods can often be an afterthought. Measures of signal complexity can be calculated from appropriate data with standard analytical packages and then applied broadly in many contexts. Network analyses can be learned, or collaborations established. The crucial advance is to conceive of organisms as interconnected systems functioning in complex environments, in which mechanistic pathways hold only partial sway over eventual outcomes and multiple pathways may lead to multiple different outcomes depending on internal and external context, with no one-to-one correspondence that can be elucidated via more mechanistic approaches.\n\nIn more classical research, therapeutic trials to improve cognitive or physical healthspan via strategies targeting a single pathophysiological factor have shown limited progress. The urgent need for such advances underlines the necessity of complementary, systems-based approaches. For example, the limited efficacy of beta-amyloid targeting drugs in Alzheimer’s disease, still half or less of the minimal clinically relevant outcome differences, together with the well-established complexity of normal brain function, showcases the need for systems thinking in understanding and targeting aging-related health problems (28). However, this case also paradoxically warns for the multitude and gravity of potential adverse effects already appearing when only a single factor in this complex system of highly connected mechanisms is addressed (29). Therefore, it is both relevant and urgent to study biological aging from a systems perspective, to gain new horizons for improving healthspan, but also to safeguard the aging population against iatrogenic losses.\n\nThe additional systems perspective we present here may be understood as another boldly proclaimed need for a paradigm shift. However, this is not our intention. Paradigms are just models and theories to help understand reality. They never become reality and often do not make other paradigms superfluous. Several modern small-particle paradigms such as string theory exist together with the Newtonian paradigm in physics, where the latter still renders valuable models to explain real-world collisions and shapes education tools. Likewise, systems thinking should be considered as a practical, complementary paradigm for which validly, reliably, and reproducibly applicable methodological tools are available to integrate reductionist perspectives and data sets in aging research. We can also create a network of paradigms in aging research that can be applied as appropriate depending on the subject. As such, the paradigms based on the Hallmarks of Aging, the evolutionary disposable soma theory, precision medicine, personalized medicine, and the systems thinking of complexity science can together strengthen gerontological research, teaching, and inspiring geriatric health services. Sometimes already available clinical or epidemiological datasets can be used in systems research; sometimes specific data should be acquired (eg, time series of outcomes) or new types of data can be generated (eg, simulation data from computational systems-based modeling). This all opens up exciting new research opportunities, but also—especially at this initial phase—requires humility, scientific rigor, and transparency in our research practice.\n\n",
    "Noblesse Oblige": "In this context, the status of systems thinking as a reasonably new paradigm in gerontology requires prudence during application in research practice. This was also a criterion in selecting the papers in this special issue. Prudence should be demonstrated in a careful and understandable introduction of the methods used. By definition, complexity science methods connect different subdisciplines, and therefore extra effort is required to explain methods, statistics, and results for colleagues outside one’s own research niche so that these are readable, understandable, and—most importantly—repeatable. Abbreviations and jargon should be prevented even more than usual. Two complementary methods sections might be helpful: a first short section describing the methods essentials in lay terms, and a second (appended) section giving the full details, understandable and repeatable outside one’s own research group. Readability and replication for the interdisciplinary gerontological research community will be as necessary as proofs of principle for wider application of systems thinking. The latter are already present partly in the papers presented here, but still require fruitful translation in intervention studies. This may come when the base of application is strong enough, as was shown, for example, already by the application of systems thinking in enforcing electricity supply grids, in improving biological diversity in systems-based ecological projects, and improving the reactions of financial markets to the coronavirus disease 2019 disruption (30).\n\nTo conclude, we think that embracing systems thinking in biological and medical gerontology will be of great added value in studying many gerontological research questions, though this will not dissolve the huge differences in perspectives on aging, shown even among the most advanced scholars in the field (31). However, we do think and hope that by adding the systems perspective and applying its methods, both these differing perspectives and variety of scientists and disciplines involved become more synergistically connected in studying the big questions in this era of global aging. And, of course, we hope that you enjoy reading this special issue, and start considering how these principles and methods may be applied in your own research system.\n\n"
  },
  "mesh_terms": [
    "Humans",
    "Aging",
    "Geriatrics",
    "Aged",
    "Healthy Aging",
    "Frailty"
  ],
  "keywords": [],
  "citation_count": null,
  "authors": [
    {
      "name": "Alan A Cohen",
      "affiliations": [
        "Robert N. Butler Columbia Aging Center and Department of Environmental Health Sciences, Columbia University , New York, New York ,"
      ]
    },
    {
      "name": "Marcel G M Olde Rikkert",
      "affiliations": [
        "Department of Geriatric Medicine, Radboud University Medical Center , Nijmegen ,"
      ]
    }
  ],
  "year": 2024,
  "journal": "The Journals of Gerontology, Series A: Biological Sciences and Medical Sciences",
  "pmid": "39352172",
  "pmcid": "PMC11443544",
  "collection_date": "2025-10-09",
  "is_negative_example": true
}