{
  "doi": "10.1111/1467-9566.13675",
  "title": "Training the ageing bodies: New knowledge paradigms and professional practices in elderly care",
  "abstract": "In the Scandinavian countries, reablement has become a principle permeating all parts of elderly care, hence potentially transforming care and care work. This article explores the advent of new knowledge paradigms and practices of physiotherapists and occupational therapists transforming reabling care in particular ways, leading to what we term a logic of training emerging in the field. These professional groups have obtained a dominant position as reablement specialists in Norway and Denmark, where our extensive fieldwork was performed as part of a 3-year research project. Taking inspiration from Annemarie Mol's concept of logic, we study how professional practices are organised and infused with specific values, meanings and ideals in situated contexts. We hence explore the logic of training, its abstracted image of the body and rational goal-oriented model for progress measurement and its ramifications when addressing ageing bodies in a complex field marked by the unpredictabilities of the social and lived bodies, administrative rules and temporalities and the quest for empowering and involving clients. The paper concludes by pointing at new contradictions arising when practicing reabling care and particularly points out the tensions arising in care relations, where ambitions on empowering and disciplining the client and the elderly body may collide.",
  "full_text": {},
  "mesh_terms": [
    "Humans",
    "Aging",
    "Physical Therapists",
    "Professional Practice",
    "Norway"
  ],
  "keywords": [
    "care work",
    "logic",
    "physiotherapy",
    "reablement"
  ],
  "citation_count": 3,
  "authors": [
    {
      "name": "Annette Kamp",
      "affiliations": [
        "Department of People and Technology Roskilde University  Roskilde Denmark"
      ]
    },
    {
      "name": "Betina Dybbroe",
      "affiliations": [
        "Department of People and Technology Roskilde University  Roskilde Denmark"
      ]
    }
  ],
  "year": 2023,
  "journal": "Sociology of Health &amp; Illness",
  "pmid": "37291653",
  "pmcid": null,
  "collection_date": "2025-10-09",
  "is_negative_example": true
}