{
  "doi": "10.1097/GOX.0b013e31828ed1da",
  "title": "The Science and Theory behind Facial Aging",
  "abstract": "The etiology of age-related facial changes has many layers. Multiple theories have been presented over the past 50-100 years with an evolution of understanding regarding facial changes related to skin, soft tissue, muscle, and bone. This special topic will provide an overview of the current literature and evidence and theories of facial changes of the skeleton, soft tissues, and skin over time.",
  "full_text": {
    "INTRODUCTION": "The etiology of age-related facial changes has many layers. Multiple theories have been presented over the past 50–100 years with an evolution of understanding regarding facial changes related to skin, soft tissue, muscle, and bone.1–10 Historically, facial dystrophic changes were attributed to gravity on the soft tissues over time and the descent of the facial bony scaffolding.11–14 Gonzalez-Ulloa and Flores15 presented their theory on facial aging and “senility of the face” almost 50 years ago. They first described facial aging in relation to changes of the skin, descent of the soft tissues, attrition of the facial septa, and craniofacial resorption based on observation. Plastic surgeons have searched to uncover the true myths behind facial aging in their quest to restore attractive, youthful facial characteristics in their patients. External environmental factors such as body mass index, hormones, alcohol consumption, cigarette smoking, and unprotected sun exposure have all been associated with contributing to an accelerated appearance of facial aging.1 Pessa and Rohrich et al6,15–26 have spent 3 decades in evaluating and studying the anatomical facial changes that occur in the facial skeleton and overlying soft tissues over time. Earlier dogma of facial aging has only been recently supplanted after careful adiographical and scientific evidence of the tangible changes to facial skeleton, soft tissue, and skin and the three-dimensionality of facial changes with time. This special topic will provide an overview of the current literature and evidence and theories of facial changes of the skeleton, soft tissues, and skin over time.\n\n",
    "FACIAL SKELETON": "Original theories behind facial aging have focused on soft-tissue laxity, ptosis, and descent of the envelope over time on account of gravity. Anatomical observational studies evaluating skeletal morphological changes of the midface, mandible, and orbit over time by authors such as Hellman, Lambros et al, Pessa et al, and Shaw and Langstein et al confirm bony facial remodeling over the course of one’s life.7,20,25,27,28 Hellman7 identified that facial shape continued to change throughout life and outlined morphological differentiation of the facial skeleton. Three-dimensional stereolithography and facial computer topographic scanning provided radiological evidence of the facial remodeling in young and old, looking at specific changes to the maxilla, mandible, pyriform, glabella, and orbits.20,21,25,28 Lambros and Pessa et al uncovered the clockwise rotation of the midface in relation to the cranial base in separate younger and older individuals (Fig. 1). These studies highlighted the characteristic changes in the aging facial skeleton, concentrating on the posterior displacement of the maxilla, lateral inferior shifting of the lateral and inferior orbital rim, creating a larger orbital aperture, and shrinking of the mandible in a vertical and a horizontal plane. Pessa et al23 further expanded on Hellman’s work confirming facial skeletal “differentiation” with time, showing an increase in mandibular size and shape over time and the sexual dimorphism in lower facial shape (Fig. 2). These skeletal changes create dramatic shifting of the overlying soft tissue and retaining ligaments of the face, and when combined with fat atrophy and volume loss, these provide a tangible explanation behind the complex, multifaceted etiology of facial aging. Obviously, limitations to these studies are use of different younger and older individuals in their comparison; however, their findings should not be dismissed. These landmark studies opened new doors in understanding the complexities of facial aging and the pivotal role of facial bony resorption and remodeling. Changes to the bony scaffolding with time inarguably lead to significant facial change and act in concert with soft-tissue atrophy and laxity, creating the appearance of aging.\n\nA graduated level of understanding of these changes leads to the development of specific treatment modalities designed to address the bony attrition with techniques such as focused midface and chin implantation and subperiosteally placed calcium hydroxyapatite filler (ie, Radiesse).\n\n",
    "FACIAL SOFT TISSUE AND FAT COMPARTMENTS": "The recent description of the superficial and deep fat compartments of the face by Rohrich and Pessa20 and radiological confirmation by Gierloff et al29 not only reinforced the soft-tissue compartmentalization of the face but also provided further support of the theory of facial deflation and volume changes to these compartments over time (Figs. 3 and 4). Defined anatomical boundaries of the nasolabial, medial, middle, lateral superficial cheek, deep medial cheek, suborbicularis, buccal, and periorbital fat compartments provide evidence of the compartmentalization of the facial soft issues. Further, injection studies performed by Pessa, Rohrich, and Ristow et al highlighted the powerful topographical changes that occur with limited volumetric changes in these specific areas of the face (Figs. 5 and 6).26 Attenuation of the zygomatic-cutaneous, orbitomalar, and mandibular retaining ligaments of the face gives the appearance of descent of the facial soft tissue, and as anatomical studies have confirmed, it acts as a hammock to the atrophied fat compartments and soft tissues of the face, contributing to the morphological appearance of the tear trough deformity, malar bags, and jowling.5,6,11,12,17,29–33 The deflation and loss of the normal anatomic subcutaneous facial fat compartments gives off the appearance of increased skin laxity or prominent folds around the nasolabial region, periorbital region, and jowl.15–19,32–42 It was once thought that along with atrophy and changes of the facial fat over time, the mimetic musculature and periosteum of the face also underwent similar changes. However, using magnetic resonance imaging, Gosain et al26 found that although facial soft tissues underwent ptosis and subcutaneous hypertrophy in the deep cheek over time, the mimetic musculature was unchanged in volume and length.\n\nThe uncovering of fat compartmentalization of the face has revolutionized the approach to facial rejuvenation. Focused localized fat injection and/or soft-tissue filler into discrete compartments, such as the deep medial, and middle fat pads of the cheek, has a dramatic effect on facial volume and reshaping the soft tissues of the face into an anatomically more youthful position.15–18 Fat injection techniques in combination with the resuspension of the facial and neck soft tissues through rhytidectomy, release of the retaining ligaments, and/or superficial musculo-aponeurotic system and platysma repositioning address specific soft-tissue changes on an individualized basis. Increasing anatomical understanding of facial soft-tissue morphological changes over time allows for tailoring of the rejuvenation techniques to specific deficiencies uncovered with detailed facial analysis.\n\n",
    "FACIAL SKIN": "The skin is the envelope or canvas of the face, revealing the deflation and atrophic changes of the underlying bone and soft-tissue compartments as previously discussed. However, in addition, the skin also goes through intrinsic changes over time on account of external and internal factors.43,44 Some suggest that repetitive dynamic muscle contractions result in the appearance of superficial and deep rhytids over areas of habitual muscle contractions such as the orbicularis oculi and oris, risorius, frontalis, and corrugators on account of fascial partitioning and connections of the dermis and periosteum between the different facial muscle groups. Smoking and photodamage result in increased production of intracellular reactive oxidative intermediates and species and cause a multitude of facial skin changes resulting in epidermal thinning, solar elastosis, and dermal collagen disorganization, leading to characteristics consistent with aging skin (Fig. 7).1,43,45,46\n\nSolar elastosis is the term used to describe the histologic appearance of the photoaged dermal extracellular matrix. This condition is characterized by an accumulation of amorphous, abnormal elastin material surrounding a decreased volume and disorganized array of wavy collagen fibrils.47–50 It is hypothesized that the abnormal elastin results from overproduction of normal elastin, which is subsequently degraded by the chronic inflammatory state.47 The other major components of extracellular matrix, glycoproteins and glycosaminoglycans (GAGs), tend to diminish with age, but they are ironically increased in photoaged skin.43–46,49–53\n\nUltra violet A (UVA) and ultra violet B (UVB) radiation causes direct and indirect damage to skin through absorption of the Ultra violet (UV) energy. The two most significant UV spectrum chromophores in skin are DNA and urocanic acid. Although UVA has been shown to directly induce DNA changes, its main route of cell damage is indirect, that is, through the creation of reactive oxygen species and free radicals.46–55 Several matrix metalloproteinases combine to degrade the collagen extracellular framework, leading to an increase in oxidative stresses contributing to the degradation of the surrounding collagen and increased elastin production. The epidermis undergoes characteristic histological changes with sun damage, leading to increased thickness, slower keratinocyte turnover, and decreased melanocyte counts. However, there are also regions of increased melanocyte concentration, with increased capacity for melanin production and deposition to keratinocytes, which present as solar lentigines.46,54–58\n\nIt is important to remember that UVB light is almost completely absorbed by the epidermis, and thus dermal photodamage is solely caused by UVA. In unprotected skin, there is an increase in all cells and extracellular matrix contents, elastin, and GAGs, and in fibroblast and Langerhans cells.48–51 UV radiation has also been shown to increase angiogenesis and likely accounts for the telangiectases seen in sun-exposed skin.\n\nIn contrast to the epidermis, the histologic picture of photoaged dermis on the cellular level is one of chronic inflammation. Fibroblast and Langerhans cells are decreased and surrounded by abundant inflammatory infiltrate. Fibroblasts are morphologically abnormal and produce less collagen due to impaired signaling (lessened response to transforming growth factor beta). Langerhans cells decrease in number and undergo functional and morphologic changes. Interestingly, other major components of extracellular matrix, glycoproteins and GAGs, tend to diminish with age, but they are increased in photoaged skin.44–59 However, the increased GAGs are not found in the papillary dermis as usual; instead they are deposited in the reticular dermis within the elastotic material and are not able to regulate dermal hydration, leading to dry and leathery-appearing skin.\n\nThere is unquestionably a powerful genetic component to facial skin aging, which in turn plays a significant role in overall skin appearance over time. This is likely the most powerful intrinsic factor of the appearance of skin aging.44–59\n\nOf all topical treatment modalities and gimmicks for skin wrinkle improvement and rejuvenation, there is substantial level 1 evidence behind the success of tretinoin in the treatment of photoaged and damaged skin. Actions of tretinoin, which is the active form of retinol, include prevention of the activation of matrix metalloproteinases and oxidative stress, and stimulation of regeneration of the ever-important extracellular matrix. Retinoids also inhibit keratinocyte differentiation and stimulate epidermal hyperplasia with increased keratinocyte turnover (Fig. 8). The addition of retinoids with various resurfacing procedures has proven to be impressively beneficial in the improvement of mild-to-moderate facial rhytids.43,47–52,60–62\n\n",
    "CONCLUSIONS": "To adequately restore youthful facial characteristics, adequate understanding of facial morphological changes over time in its entirety is essential. Over the past 20–30 years, sound scientific data and tangible evidence have provided a foundation for understanding the changes to the facial skin, soft tissue, and bony scaffolding that have been theorized to contribute to facial aging. However, understanding of facial changes over time is still in its infancy, and facial changes can only truly be understood when comparing the changes of the facial components in a single individual at variable time points over the course of a life as first instituted almost a century ago with the Bolton-Brush longitudinal growth study at Case Western Reserve School of Dentistry.7,23 Obviously, the evaluation of radiographical and/or anatomical changes of the same person over time is quite difficult. However, the historical theories of facial aging being attributed to the descent of soft tissues have now not only been validated by sound anatomical and radiographical observational studies but also expanded on advancing our understanding of the complexities of overall facial morphological change with time.8–10 The recent uncovering of anatomical facial fat compartment anatomy has revolutionized the concept and approach of adding volume to specific deflated soft-tissue compartments, creating a more individualized youthful restoration to the face. The outstanding improvement in understanding has compartmentalized the treatment strategy to facial rejuvenation. Restoring youthful characteristics starts from the skeletal framework and builds progressively to the canvas of the face. With proper diagnosis and facial analysis, specific age-related changes can be addressed. By improving the skeletal proportions of the midface with calcium hydroxyapatite, or implants, or restoring proper position and volume of the soft tissues with fat grafting and manipulation of the superficial musculo-aponeurotic system and lid structures, or lastly through skin rejuvenation with tretinoin, botulinum injections, or resurfacing, youthful characteristics of the face can be restored in a stepwise organized fashion that is tailored to the specific changes in the individual.\n\nMorphological changes to the facial skeletal framework, soft tissue, retaining ligaments, fat compartments, and skin envelope all contribute to facial aging in variable degrees depending on the intrinsic and extrinsic factors highlighted in this report. To provide our patients with the best possible rejuvenation strategy, appropriate diagnosis of the physiological changes of each of the elements of facial aging is imperative.\n\n",
    "PATIENT CONSENT": "Patients provided written consent for the use of their images.\n\n"
  },
  "mesh_terms": [],
  "keywords": [],
  "citation_count": 118,
  "authors": [
    {
      "name": "Jordan P. Farkas",
      "affiliations": []
    },
    {
      "name": "Joel E. Pessa",
      "affiliations": []
    },
    {
      "name": "Bradley Hubbard",
      "affiliations": []
    },
    {
      "name": "Rod J. Rohrich",
      "affiliations": []
    }
  ],
  "year": 2013,
  "journal": "Plastic and Reconstructive Surgery Global Open",
  "pmid": "25289202",
  "pmcid": "PMC4174174",
  "collection_date": "2025-10-09",
  "is_negative_example": true
}