{
  "doi": "10.1152/physrev.1998.78.2.547",
  "title": "The Free Radical Theory of Aging Matures",
  "abstract": "The free radical theory of aging, conceived in 1956, has turned 40 and is rapidly attracting the interest of the mainstream of biological research. From its origins in radiation biology, through a decade or so of dormancy and two decades of steady phenomenological research, it has attracted an increasing number of scientists from an expanding circle of fields. During the past decade, several lines of evidence have convinced a number of scientists that oxidants play an important role in aging. (For the sake of simplicity, we use the term oxidant to refer to all \"reactive oxygen species,\" including O2-., H2O2, and .OH, even though the former often acts as a reductant and produces oxidants indirectly.) The pace and scope of research in the last few years have been particularly impressive and diverse. The only disadvantage of the current intellectual ferment is the difficulty in digesting the literature. Therefore, we have systematically reviewed the status of the free radical theory, by categorizing the literature in terms of the various types of experiments that have been performed. These include phenomenological measurements of age-associated oxidative stress, interspecies comparisons, dietary restriction, the manipulation of metabolic activity and oxygen tension, treatment with dietary and pharmacological antioxidants, in vitro senescence, classical and population genetics, molecular genetics, transgenic organisms, the study of human diseases of aging, epidemiological studies, and the ongoing elucidation of the role of active oxygen in biology.",
  "full_text": {},
  "mesh_terms": [
    "Aging",
    "Animals",
    "Antioxidants",
    "Free Radicals",
    "Humans",
    "Oxidation-Reduction",
    "Species Specificity"
  ],
  "keywords": [],
  "citation_count": 2947,
  "authors": [
    {
      "name": "KENNETH B. BECKMAN",
      "affiliations": [
        "Department of Molecular and Cell Biology, University of California, Berkeley, California"
      ]
    },
    {
      "name": "BRUCE N. AMES",
      "affiliations": [
        "Department of Molecular and Cell Biology, University of California, Berkeley, California"
      ]
    }
  ],
  "year": 1998,
  "journal": "Physiological Reviews",
  "pmid": "9562038",
  "pmcid": null,
  "collection_date": "2025-10-09"
}