{
  "doi": "10.1073/pnas.2300624120",
  "title": "A step toward precision gerontology: Lifespan effects of calorie and protein restriction are consistent with predicted impacts on entropy generation",
  "abstract": "Understanding aging is a key biological goal. Precision gerontology aims to predict how long individuals will live under different treatment scenarios. Calorie and protein restriction (CR and PR) extend lifespan in many species. Using data from C57BL/6 male mice under graded CR or PR, we introduce a computational thermodynamic model for entropy generation, which predicted the impact of the manipulations on lifespan. Daily entropy generation decreased significantly with increasing CR level, but not PR. Our predictions indicated the lifespan of CR mice should increase by 13 to 56% with 10 to 40% CR, relative to ad libitum-fed animals. This prediction was broadly consistent with the empirical observation of the lifespan impacts of CR in rodents. Modeling entropy fluxes may be a future strategy to identify antiaging interventions.",
  "full_text": {
    "Results - First Law Assessment of Cellular Metabolism Subsystem.": "Especially in the biothermodynamics field, the internal energy content of a chemical compound is called enthalpy (19). The standard enthalpy of formation (Δh°f) values of the major chemical components in the diets and their oxidation reaction products (SI Appendix, Table S1) were used to calculate the daily enthalpy of oxidation reaction (Δhrxn) of the diets for CR and PR groups. In this study, Δhrxn refers to the extracted energy (kJ) at the cellular level (SI Appendix, Fig. S1). Δhrxn levels were higher in mice fed PR compared to CR due to the reduced protein levels being replaced by carbohydrate while maintaining the same total calorie intake across the PR groups (SI Appendix, Fig. S1). This causes very similar work outputs (kJ) fueled by cellular metabolism of the PR groups (19.5 to 20.2 kJ). In the CR groups, average daily total work (kJ) output fueled by the cellular metabolism decreased with the increasing CR level (R-square > 0.99, P < 0.05). The CR animals might compensate for low-energy input with decreased total work performance (SI Appendix, Fig. S2 A and B). There was no significant relationship between average daily total work (kJ) output fueled by the cellular metabolism and level of PR. The ratio of this work to the net extracted energy by the cellular metabolism subsystem was defined as the first law efficiency. There was no significant relationship between the average daily first law efficiency (%) and energy intakes (kJ) or restriction levels (%) of CR and PR groups (SI Appendix, Fig. S4 A and C).\n\n",
    "Results - Second Law Assessments of Cellular Metabolism Subsystem.": "Within the context of the second law of thermodynamics, the exergy term basically refers to the “maximum useful work potential” that a system can produce if it is brought to thermodynamic equilibrium with its surroundings. Hence, it is a system–environment combination property. Unlike energy, exergy is always wasted in irreversible processes and this wasted work potential is defined as exergy destruction (Exdest) (2). In the current study, the exergy values (kJ) of chemical molecules of diet, adipose tissue and oxidation reactions’ products were calculated based on the mole numbers of molecules and the daily average body temperature of CR and PR animals. All these calculated values were used in exergy balance (Eq. 17), which was equated around the cellular metabolism subsystem (Fig. 1) to find the daily Exdest of the animals. One of the ultimate aims of this study was the calculation of daily entropy generation, Sgen, (kJ/K) via cellular metabolism. Hence, daily average body temperature and calculated daily Exdest values were used for this purpose via Eq. 19 as explained in the Materials and Methods.\n\nThe second law efficiency was defined in this study as the ratio of work flux fueled by cellular metabolism to the maximum theoretical exergy (Eq. 18). The average daily second law efficiency of CR groups (SI Appendix, Fig. S4B) was significantly related to the exergy input of CR groups (R-square > 0.78, P < 0.05). However, no relationship was found with the PR groups (SI Appendix, Fig. S4D). In the present study, internal work components (Wint,1 + Wint,3) had a dominant effect on the total work expense that was fueled by the cellular metabolism subsystem and these work components had a decreasing contribution with increasing CR level (SI Appendix, Fig. S5A). In contrast, the exergy input and corresponding internal work components fueled by cellular metabolism across the PR levels and 24 h ad libitum (24AL) were very similar (SI Appendix, Fig. S5B). The effect of external (muscle) work (Wext) on second law efficiency was very low under both CR and PR conditions (SI Appendix, Fig. S4 A and B). A major increase (more than four times) in average daily external (muscle) work was observed in both CR and PR groups exposed to restriction levels higher than 9.6% probably because of increased hunger (20, 21) which has been linked to the resultant food anticipatory activity (22) (SI Appendix, Fig. S5 A and B).\n\nThe calculated daily entropy generation (kJ/K) values by using the daily exergy destruction values are given in SI Appendix, Fig. S6 A and B. The average daily entropy generation was found to decrease with increasing CR level (%) (Fig. 2A and SI Appendix, Fig. S6A) or in other words decreasing exergy intake (R-square > 0.99, P < 0.05). Similarly in another thermodynamic assessment study (11), the entropy generated by the cellular metabolism subsystem increased with increments in the average exergy intake (R-square > 0.99, P < 0.05) in obese and lean rats. On the other hand, for the PR groups, there was no significant relationship between the average daily entropy generation and PR levels (%) (P > 0.05) (Fig. 2B and SI Appendix, Fig. S6B) but if we consider the exergy intake (kJ) of PR groups instead of restriction levels (Fig. 2C), a significant relationship with entropy generation rates is clear (R-square > 0.93, P < 0.05).\n\nThe average daily entropy generation (kJ/K) by the CR groups was positively related to the work output fueled by the cellular metabolism (kJ) (R-square > 0.97, P < 0.05) (Fig. 2A and SI Appendix, Fig. S2). A similar linear relationship between work output and entropy generation was computationally estimated using experimental energetic datasets (23–26). Both internal (i.e., respiration, cardiac functions, signal transmission through the neurons etc.) and external or muscular (i.e., energy consumption for the skeletal muscle contraction to move external objects or the animals’ own body) work are irreversible processes in a living system that, as the second law of thermodynamics states, result in entropy generation. No relationship between average daily total work output and entropy generation was observed under PR (P > 0.05).\n\nThe entropy generation hypothesis suggests that animals die when their entropy generation (or in other words, molecular disorder) levels reach a certain level (1). The problem is that the level at death is unknown. However, we do know the average lifespan of unrestricted C57BL/6 mice and hence we can combine that with the calculated average daily entropy generation rates derived here to estimate the lifespan entropy in that situation, and then quantitatively predict the impacts of altered entropy generation rates (Fig. 2A) on the expected lifespans of CR and PR mice. Table 1 shows that, with 9.6 to 44% restriction in calorie intake, the predicted lifespan increases by 91 to 405 d compared to the 24AL group. PR mice have a higher energy or exergy intake, and higher entropy generation rates than those of mice fed an equivalent CR level (Fig. 2 A and B). As a result, the predicted lifespan increments of the PR groups (51 to 154 d) were lower compared to the CR groups.\n\n",
    "Discussion - First and Second Law Efficiencies.": "From the first law efficiency calculations, approximately 37% of the net daily food energy extracted by the cellular metabolism was used to fuel internal and muscle work for the 24AL group. Note the first law efficiency value does not include the contribution of adipose tissue and organs’ to work fueling. Maximum enthalpy efficiencies (i.e., first law efficiencies) for a variety of murine skeletal muscles were previously calculated as between 26% and 48% (27). These support the calculations performed here and are comparable to the first law efficiency of muscle work. Additionally, these values were close to experimental result of tortoise muscle energetic efficiency reported as 35% (28). The second law efficiencies were lower than the first law efficiencies (SI Appendix, Fig. S4 A–D) because the first law efficiency concept does not consider the best possible performance as a reference. However, in the second law efficiency assessments, the measure of actual performance is compared to the best possible performance under the same conditions. Second law efficiency evaluations can give an indication of system performance under reversible conditions. Correspondingly, if the second law efficiency is low, that means there is high irreversibility, and each irreversible process contributes to the entropy generation by the system. Therefore, an inverse relationship between second law efficiency and entropy generation rate would be expected. In the PR animals, where exergy content was very similar, this expected significant inverse relationship was found (R-square > 0.93, P < 0.05). However, in the CR groups fed variable exergy content, average daily entropy generation had a much stronger relationship with average daily exergy input (R-square > 0.99, P < 0.05), instead of with the average daily second law efficiencies. Because, with the decrement of exergy intake, total work outputs also decreased, and this caused the general decreasing trend in second law efficiencies, which is the ratio of these two variables. In our study, the inverse relationship between second law efficiency and entropy generation was observed when the exergy input was similar for the compared systems.\n\n",
    "Discussion - Implications of Entropy Generation Changes for Lifespan.": "The calculated lifespan increment percentages were compared with values from the literature, including the experimental lifespan increment percentages and the corresponding CR levels (18, 29) (Fig. 3A). Based on this comparison, the effect of CR level on lifespan was not as high as computationally predicted lifespans based on the average daily entropy generation (Fig. 3A). There are several potential explanations for this discrepancy. In the current study, estimates of the entropy generation were based on the experimental data obtained over 3 mo, with the animals 8 mo old at the end of the study. In the lifespan calculation, we assumed that the calculated average daily entropy generation is maintained as same during the entire life of animals and the lifespan predictions were made based on this assumption. However, in reality, the average daily entropy generation may vary with time under restriction making the computational predictions more optimistic than the experimental lifespan results (Fig. 3A). The discrepancy would be consistent with entropy generation accelerating at later ages.\n\nDietary protein percent values in the study of Speakman et al. (18) were converted to PR percentages based on the baseline from our study, these were then compared with our computational results in Fig. 3B. It seems that PR level had a very heterogenic/random effect on the lifespan increment based on literature (18). While the calculated predicted lifespan increments for CR diets were higher, calculations for the PR diets were within the range of the literature values (Fig. 3 A and B). The regression equations were extracted from studies to find the empirical relationship between the % increase in lifespan and CR and PR (18). In the current study, these equations are also evaluated to calculate lifespan day predictions, and these days are compared with the introduced thermodynamical modeling predictions (Table 1). Our model predicts a higher lifespan for all CR and PR groups bar the 39.6% PR (Table 1). The difference in calculated lifespan days was higher where the CR was higher; however, in the PR animals, the difference in lifespan days decreased with increasing restriction levels (Fig. 3 A and B).\n\nNotably, the relationship between PR level and extension of lifespan was negative (Fig. 3C). The effect of PR on the lifespan of rodents has been previously reviewed in detail (18). Although diets with reduced protein content may increase the median lifespan (17, 30), the effect is only apparent with much lower levels of protein than tested here. This previous analysis emphasized that PR is effective but over a different range of restriction levels than CR works (18). This current computational research revealed a similar observation (Fig. 3C). With regard to the PR groups, although the protein amount was decreased, the same energy or exergy content was provided to all PR groups, therefore “predicted lifespan increment percentages” of these groups were also close to each other and had a significant linear relationship with exergy intake of PR groups (R-square > 0.94, P < 0.05) but had no significant relationship with the PR percentage levels (P > 0.05) (Fig. 3C). However, a strong linear relationship (R-square > 0.99, P < 0.05) between the predicted lifespan increment percentages and CR level was observed. This result parallels the suggestion that the effect of food restriction on lifespan is primarily due to reduced calories and not reduced protein intake (18). Refining the prediction using modeling of empirical data over a more extended period would be necessary to test this idea, but such data are currently not available.\n\nThe current data show that the impacts of CR and PR on the rate of entropy generation produced mean lifespan estimates that are broadly consistent with the actual impacts of these manipulations on published mean lifespan in rodents. Hence the data provide some support for the entropy generation model for lifespan and aging as originally proposed by Schrodinger in 1944 (1). This work therefore establishes as a concept the idea that quantifying entropy generation rates may provide a framework for evaluating diverse manipulations that potentially impact lifespan. Moreover, understanding the physiological processes that are connected to entropy changes will potentially provide a mechanism for identifying novel targets for aging interventions. Under fixed dietary conditions, individuals vary in how long they live and also in their individual entropy generation rates. A major goal for future work is to delineate whether these individual differences in entropy generation and lifespan are connected, or whether individual lifespan is dominated by unpredictable stochastic events. If individual lifespan is predictable from individual variation in entropy generation this would yield the potential to predict when an individual will die—a key goal in precision gerontology.\n\n",
    "Conclusion": "Life generates entropy (disorder), but the rate at which it does so is not the same across all conditions. Entropy probably accumulates because the cost to reverse its increase is too great. Schrodinger (1) suggested that ultimately we age and die because of this entropy accumulation. In other words, we die because the bodily system becomes so disordered that it can no longer sustain the functions we recognize as living. This idea has never been directly tested by quantifying the rate of entropy accumulation across different conditions and seeing if that matches the differences in observed lifespan. Here, we performed such entropy generation calculations for mice engaged in CR and PR and showed that the broad patterns of lifespan response to these manipulations can be predicted from entropy generation rates consistent with Schrodinger’s hypothesis (1)\n\n",
    "Materials and Methods": "Data from male C57BL/6 mice undergoing 3 mo of graded CR or PR were adapted for thermodynamic assessment (22, 31–33). Control mice, fed ad libitum for 12 and 24 h are referred to as 12AL and 24AL groups, respectively. While designing the CR experiments, the average levels of restrictions were stated as 10, 20, 30, and 40% CR relative to their individual baseline 12AL intakes prior to the CR phase of the study. However, if the food intake of 12AL, 10, 20, 30, and 40% CR groups are compared relative to the average intake of the 24AL group in the final week, the approximate values of the percentage levels of restrictions become 9.6, 17, 24, 35, and 44%, respectively (31). In the PR study, the control group was fed 12AL with the same diet, 20% protein, as the CR study (31). Accordingly, restriction levels of the PR groups were calculated as 29.6, 39.6, and 49.6% relative to the 24AL group, respectively. PR diets were formulated by substituting the reduced protein with carbohydrates; the three PR diets were calorically equal (31). The following assumptions were considered while carrying out the analysis:\n\nThe resting metabolic rate (RMR) was assumed to be the same as the total internal work (Wint,total). Internal work performance, which was depicted as “internal work sink subsystem” in Fig.1, was fueled by both adipose tissue and the utilized organs, in addition to cellular metabolism.\n\nEnergy expense of organ investment (Wint,1) was part of the total internal work cost and fueled only with energy coming from the metabolism of nutrients.\n\nOn some occasions, a fraction of the energy provided by the food was accumulated in the adipose tissue (Eadipose). Otherwise, adipose tissue functioned as an internal energy source and provided energy to fuel a part of the internal work (Wint,2).\n\nAll the energy obtained from organ utilization fueled part of the internal work (Wint,4).\n\nIn the external (muscular) work (Wext) calculations, work against friction is not accounted for.\n\nThe residual internal work energy expense was calculated after subtracting Wint,1, Wint,2 and Wint,4 from the total internal work (Wint,total). The residual internal work (Wint,3) energy expense was fueled with the energy coming from the cellular metabolism.\n\nIt was assumed that the energy utilized from the adipose tissue and organs entered the internal work sink subsystem and used only for work; however, the total internal heat output (Qint,total) was fueled only by cellular metabolism.\n\nAccording to the information provided by the supplier of the mice (Charles-River), the average 50% survival rate for male C57BL/6J mice fed a diet similar to that used in the CR study was around 720 d. In the current study, this lifespan was assumed to be the same for control (24AL) groups.\n\n"
  },
  "mesh_terms": [
    "Male",
    "Animals",
    "Mice",
    "Mice, Inbred C57BL",
    "Longevity",
    "Entropy",
    "Diet, Protein-Restricted",
    "Geriatrics"
  ],
  "keywords": [
    "aging",
    "calorie restriction",
    "entropy",
    "protein restriction"
  ],
  "citation_count": 11,
  "authors": [
    {
      "name": "Ayşe Selcen Semerciöz-Oduncuoğlu",
      "affiliations": [
        "Department of Food Engineering, Faculty of Engineering, Yeditepe University, Istanbul 34755, Turkey",
        "Institute of Biological and Environmental Sciences, University of Aberdeen, Aberdeen AB24 2TZ, Scotland, UK"
      ]
    },
    {
      "name": "Sharon E. Mitchell",
      "affiliations": [
        "Institute of Biological and Environmental Sciences, University of Aberdeen, Aberdeen AB24 2TZ, Scotland, UK"
      ]
    },
    {
      "name": "Mustafa Özilgen",
      "affiliations": [
        "Department of Food Engineering, Faculty of Engineering, Yeditepe University, Istanbul 34755, Turkey"
      ]
    },
    {
      "name": "Bayram Yilmaz",
      "affiliations": [
        "Department of Physiology, Faculty of Medicine, Yeditepe University, Istanbul 34755, Turkey"
      ]
    },
    {
      "name": "John R. Speakman",
      "affiliations": [
        "Institute of Biological and Environmental Sciences, University of Aberdeen, Aberdeen AB24 2TZ, Scotland, UK",
        "Shenzhen Key Laboratory of Metabolic Health, Center for Energy Metabolism and Reproduction, Shenzhen Institutes of Advanced Technology, Shenzhen 518055, China",
        "Institute of Genetics and Developmental Biology, Chinese Academy of Sciences, Beijing 100101, China"
      ]
    }
  ],
  "year": 2023,
  "journal": "Proceedings of the National Academy of Sciences",
  "pmid": "37669389",
  "pmcid": "PMC10500274",
  "collection_date": "2025-10-09"
}