{
  "10.1371/journal.pone.0233384": {
    "title": "Exponential increase in mortality with age is a generic property of a simple model system of damage accumulation and death",
    "abstract": "The risk of dying increases exponentially with age, in humans as well as in many other species. This increase is often attributed to the \"accumulation of damage\" known to occur in many biological structures and systems. The aim of this paper is to describe a generic model of damage accumulation and death in which mortality increases exponentially with age. The damage-accumulation process is modeled by a stochastic process know as a queue, and risk of dying is a function of the accumulated damage, i.e., length of the queue. The model has four parameters and the main characteristics of the model are: (i) damage occurs at random times with a constant high rate; (ii) the damage is repaired at a limited rate, and consequently damage can accumulate; (iii) the efficiency of the repair mechanism decays linearly with age; (iv) the risk of dying is a function of the accumulated damage. Using standard results from the mathematical theory of queues it is shown that there is an exponential dependence between risk of dying and age in these models, and that this dependency holds irrespective of how the damage-accumulation process is modeled. Furthermore, the ways in which this exponential dependence is shaped by the model parameters are also independent of the details of the damage accumulation process. These generic features suggest that the model could be useful when interpreting changes in the relation between age and mortality in real data. To exemplify, historical mortality data from Sweden are interpreted in the light of the model. The decrease in mortality seen between cohorts born in 1905, compared to those born in 1885, can be accounted for by higher threshold to damage. This fits well with the many advances made in public health during the 20th century."
  },
  "10.1007/s40656-021-00402-w": {
    "title": "Can aging research generate a theory of health?",
    "abstract": "While aging research and policy aim to promote 'health' at all ages, there remains no convincing explanation of what this 'health' is. In this paper, I investigate whether we can find, implicit within the sciences of aging, a way to know what health is and how to measure it, i.e. a theory of health. To answer this, I start from scientific descriptions of aging and its modulators and then try to develop some generalizations about 'health' implicit within this research. After discussing some of the core aspects of aging and the ways in which certain models describe spatial and temporal features specific to both aging and healthy phenotypes, I then extract, explicate, and evaluate one potential construct of health in these models. This suggests a theory of health based on the landscape of optimized phenotypic trajectories. I conclude by considering why it matters for more candidate theories to be proposed and evaluated by philosophers and scientists alike."
  },
  "10.1111/1467-9566.13675": {
    "title": "Training the ageing bodies: New knowledge paradigms and professional practices in elderly care",
    "abstract": "In the Scandinavian countries, reablement has become a principle permeating all parts of elderly care, hence potentially transforming care and care work. This article explores the advent of new knowledge paradigms and practices of physiotherapists and occupational therapists transforming reabling care in particular ways, leading to what we term a logic of training emerging in the field. These professional groups have obtained a dominant position as reablement specialists in Norway and Denmark, where our extensive fieldwork was performed as part of a 3-year research project. Taking inspiration from Annemarie Mol's concept of logic, we study how professional practices are organised and infused with specific values, meanings and ideals in situated contexts. We hence explore the logic of training, its abstracted image of the body and rational goal-oriented model for progress measurement and its ramifications when addressing ageing bodies in a complex field marked by the unpredictabilities of the social and lived bodies, administrative rules and temporalities and the quest for empowering and involving clients. The paper concludes by pointing at new contradictions arising when practicing reabling care and particularly points out the tensions arising in care relations, where ambitions on empowering and disciplining the client and the elderly body may collide."
  },
  "10.1371/journal.pone.0312149": {
    "title": "Aging by autodigestion",
    "abstract": "The mechanism that triggers the progressive dysregulation of cell functions, inflammation, and breakdown of tissues during aging is currently unknown. We propose here a previously unknown mechanism due to tissue autodigestion by the digestive enzymes. After synthesis in the pancreas, these powerful enzymes are activated and transported inside the lumen of the small intestine to which they are compartmentalized by the mucin/epithelial barrier. We hypothesize that this barrier leaks active digestive enzymes (e.g. during meals) and leads to their accumulation in tissues outside the gastrointestinal tract. Using immune-histochemistry we provide evidence in young (4 months) and old (24 months) rats for significant accumulation of pancreatic trypsin, elastase, lipase, and amylase in peripheral organs, including liver, lung, heart, kidney, brain, and skin. The mucin layer density on the small intestine barrier is attenuated in the old and trypsin leaks across the tip region of intestinal villi with depleted mucin. The accumulation of digestive enzymes is accompanied in the same tissues of the old by damage to collagen, as detected with collagen fragment hybridizing peptides. We provide evidence that the hyperglycemia in the old is accompanied by proteolytic cleavage of the extracellular domain of the insulin receptor. Blockade of pancreatic trypsin in the old by a two-week oral treatment with a serine protease inhibitor (tranexamic acid) serves to significantly reduce trypsin accumulation in organs outside the intestine, collagen damage, as well as hyperglycemia and insulin receptor cleavage. These results support the hypothesis that the breakdown of tissues in aging is due to autodigestion and a side-effect of the fundamental requirement for digestion."
  },
  "10.26633/RPSP.2025.83": {
    "title": "The voice of healthy aging for changing paradigms and changing lives: a tribute to Dr. Enrique Vega García",
    "abstract": ""
  },
  "10.1016/j.gaitpost.2014.05.062": {
    "title": "A comparison of two walking while talking paradigms in aging",
    "abstract": "BACKGROUND: Our study aimed to [1] compare dual-task costs in gait and cognitive performance during two dual-task paradigms: walking while reciting alternate letters of the alphabet (WWR) and walking while counting backward by sevens (WWC); [2] examine the relationship between the gait and cognitive interference tasks when performed concurrently.\nSCOPE: Gait and cognitive performance were tested in 217 non-demented older adults (mean age 76 ± 8.8 years; 56.2% female) under single and dual-task conditions. Velocity (cm/s) was obtained using an instrumented walkway. Cognitive performance was assessed using accuracy ratio: [correct responses]/[total responses]. Linear mixed effects models revealed significant dual-task costs, with slower velocity (p < .01) and decreased accuracy ratio (p < .01) in WWR and WWC compared to their respective single task conditions. Greater dual-task costs in velocity (p < .01) were observed in WWC compared to WWR. Pearson correlations revealed significant and positive relationships between gait and cognitive performance in WWR and WWC (p < .01); increased accuracy ratio was associated with faster velocity.\nCONCLUSIONS: Our findings suggested that dual-task costs in gait increase as the complexity of the cognitive task increases. Furthermore, the positive association between the gait and cognitive tasks suggest that dual-task performance was not influenced by task prioritization strategies in this sample."
  },
  "10.1017/S2045796017000324": {
    "title": "Healthy ageing, resilience and wellbeing",
    "abstract": "The extension of life does not appear to be slowing, representing a great achievement for mankind as well as a challenge for ageing populations. As we move towards an increasingly older population we will need to find novel ways for individuals to make the best of the challenges they face, as the likelihood of encountering some form of adversity increases with age. Resilience theories share a common idea that individuals who manage to navigate adversity and maintain high levels of functioning demonstrate resilience. Traditional models of healthy ageing suggest that having a high level of functioning across a number of domains is a requirement. The addition of adversity to the healthy ageing model via resilience makes this concept much more accessible and more amenable to the ageing population. Through asset-based approaches, such as the invoking of individual, social and environmental resources, it is hoped that greater resilience can be fostered at a population level. Interventions aimed at fostering greater resilience may take many forms; however, there is great potential to increase social and environmental resources through public policy interventions. The wellbeing of the individual must be the focus of these efforts; quality of life is an integral component to the enjoyment of additional years and should not be overlooked. Therefore, it will become increasingly important to use resilience as a public health concept and to intervene through policy to foster greater resilience by increasing resources available to older people. Fostering wellbeing in the face of increasing adversity has significant implications for ageing individuals and society as a whole."
  },
  "10.1098/rstb.2019.0727": {
    "title": "Ageing and sociality: why, when and how does sociality change ageing patterns?",
    "abstract": "Individual lifespans vary tremendously between and also within species, but the proximate and ultimate causes of different ageing speeds are still not well understood. Sociality appears to be associated with the evolution of greater longevity and probably also with a larger plasticity of the shape and pace of ageing. For example, reproductives of several termites and ants reach lifespans that surpass those of their non-reproductive nestmates by one or two decades. In this issue, 15 papers explore the interrelations between sociality and individual longevity in both, group-living vertebrates and social insects. Here, we briefly give an overview of the contents of the various contributions, including theoretical and comparative studies, and we explore the similarities and dissimilarities in proximate mechanisms underlying ageing among taxa, with particular emphasis on nutrient-sensing pathways and, in insects, juvenile hormone. These studies point to an underestimated role of more downstream processes. We highlight the need for reliable transcriptomic markers of ageing and a comprehensive ageing theory of social animals, which includes the reproductive potential of workers, and considers the fact that social insect queens reach maturity only after a prolonged period of producing non-reproductive workers. This article is part of the theme issue 'Ageing and sociality: why, when and how does sociality change ageing patterns?'"
  },
  "10.1684/pnv.2020.0862": {
    "title": "False memory in normal ageing: empirical data from the DRM paradigm and theoretical perspectives",
    "abstract": "False memories refer to falsely remembering something that did not happen or that happened differently. The effects of age on episodic memory underlie both the decline in real memories and the increase in false memories. But, what is the richness and what is the feeling of reality of false memories in the elderly? This mini-review on false memory in young and older adults presents the results from the literature using one of the most used paradigms in the laboratory to study false memories - the Deese-Roediger-McDermott paradigm. This paradigm generally consists in the presentation of semantically associated items-lists (words or images) related to a non-presented critical lure (e.g., bed, rest, awake …, the critical lure is sleep). During free recall or recognition tests, the participants regularly produce false memories (intrusions or false recognitions of the critical lures), increasingly with aging. We specifically ask the question of the richness of the false memory trace in young and older adults in terms of contextual associations (What-Where-When-Details binding) and phenomenological characteristics (remembering, knowing, guessing). We propose to examine this issue using a naturalistic episodic memory task via navigation in a virtual environment enriched with series of associated elements (e.g., vegetables stand) linked to non-presented critical lures (e.g., carrots). Based on preliminary results, we propose an integrative model of memory trace which can explain the differences observed between young and old people on the richness of their false memories."
  },
  "10.15171/apb.2019.042": {
    "title": "Anti-aging and Sunscreens: Paradigm Shift in Cosmetics",
    "abstract": "Skin, being one of the vital organs and a protective barrier needs to be pampered and taken care of from early childhood. It is the most visible and the widest exposed organ and by far reflects the general health condition and the aging process in humans. Both intrinsic and extrinsic factors contribute to this complex biological process of skin aging. In recent times, skin health and its beauty is perceived as an indicator of one's health which has resulted in an increasing demand for anti-aging products. Exposure to UV radiation is considered to be one of the factors responsible for aging termed as photoaging. In this review, we have discussed the various factors which may accelerate the process of skin aging. Various approaches and strategies to delay the process of skin aging have been emphasized upon. The patents filed in the area of anti-aging and sunscreen products have also been reviewed to gain an insight into the new formulations which have been developed as an anti-aging product. There has been a tremendous rise in the cosmetic and cosmeceuticals market with products having a dual activity of anti-aging and sun protection. Research is constantly on the rise to ensure the safety of these products. Alternatives to the current topical application of sunscreen are being considered to overcome the drawback of reapplication of the sunscreen often which can be a boon to the cosmeceutical market."
  },
  "10.1007/s10522-019-09837-y": {
    "title": "d-Galactose-induced accelerated aging model: an overview",
    "abstract": "To facilitate the process of aging healthily and prevent age-related health problems, efforts to properly understand aging mechanisms and develop effective and affordable anti-aging interventions are deemed necessary. Systemic administration of D-galactose has been established to artificially induce senescence in vitro and in vivo as well as for anti-aging therapeutic interventions studies. The aim of this article is to comprehensively discuss the use of D-galactose to generate a model of accelerated aging and its possible underlying mechanisms involved in different tissues/organs."
  },
  "10.1007/s10943-009-9319-x": {
    "title": "Theory in Religion, Aging, and Health: An Overview",
    "abstract": "This paper provides an overview of theory in religion, aging, and health. It offers both a primer on theory and a roadmap for researchers. Four \"tenses\" of theory are described--distinct ways that theory comes into play in this field: grand theory, mid-range theory, use of theoretical models, and positing of constructs which mediate or moderate putative religious effects. Examples are given of both explicit and implicit uses of theory. Sources of theory for this field are then identified, emphasizing perspectives of sociologists and psychologists, and discussion is given to limitations of theory. Finally, reflections are offered as to why theory matters."
  },
  "10.1038/s41586-024-08285-0": {
    "title": "Ageing limits stemness and tumorigenesis by reprogramming iron homeostasis",
    "abstract": "Ageing is associated with a decline in the number and fitness of adult stem cells<sup>1,2</sup>. Ageing-associated loss of stemness is posited to suppress tumorigenesis<sup>3,4</sup>, but this hypothesis has not been tested in vivo. Here we use physiologically aged autochthonous genetically engineered<sup>5,6</sup> mouse models and primary cells<sup>5,6</sup> to demonstrate that ageing suppresses lung cancer initiation and progression by degrading the stemness of the alveolar cell of origin. This phenotype is underpinned by the ageing-associated induction of the transcription factor NUPR1 and its downstream target lipocalin-2 in the cell of origin in mice and humans, which leads to functional iron insufficiency in the aged cells. Genetic inactivation of the NUPR1-lipocalin-2 axis or iron supplementation rescues stemness and promotes the tumorigenic potential of aged alveolar cells. Conversely, targeting the NUPR1-lipocalin-2 axis is detrimental to young alveolar cells through ferroptosis induction. Ageing-associated DNA hypomethylation at specific enhancer sites is associated with increased NUPR1 expression, which is recapitulated in young alveolar cells through DNA methylation inhibition. We uncover that ageing drives functional iron insufficiency that leads to loss of stemness and tumorigenesis but promotes resistance to ferroptosis. These findings have implications for the therapeutic modulation of cellular iron homeostasis in regenerative medicine and in cancer prevention. Furthermore, our findings are consistent with a model whereby most human cancers initiate at a young age, thereby highlighting the importance of directing cancer prevention efforts towards young individuals."
  },
  "10.1093/geront/gnad049": {
    "title": "Aging as Adaptation",
    "abstract": "In traditional gerontological terms, adaptation is usually understood as the production of physical aids to mitigate the impairment effects caused by age-related disabilities, or as those alterations organizations need to make under the concept of reasonable adjustment to prevent age discrimination (in the UK, e.g., age has been a protected characteristic under the Equality Act since 2010). This article will be the first to examine aging in relation to theories of adaptation within cultural studies and the humanities. It is thus an interdisciplinary intervention within the field of cultural gerontology and cultural theories of adaptation. Adaptation studies in cultural studies and the humanities have moved away from fidelity criticism (the issue of how faithful an adaptation is to its original) toward thinking of adaptation as a creative, improvisational space. We ask if theories of adaptation as understood within cultural studies and the humanities can help us develop a more productive and creative way of conceptualizing the aging process, which reframes aging in terms of transformational and collaborative adaptation. Moreover, for women in particular, this process of adaptation involves engagement with ideas of women's experience that encompass an adaptive, intergenerational understanding of feminism. Our article draws on interviews with the producer and scriptwriter of the Representage theater group's play My Turn Now. The script for the play is adapted from a 1993 coauthored book written by a group of 6 women who were then in their 60s and 70s, who founded a networking group for older women."
  },
  "10.1038/s41574-020-0335-y": {
    "title": "The role of cellular senescence in ageing and endocrine disease",
    "abstract": "With the ageing of the global population, interest is growing in the 'geroscience hypothesis', which posits that manipulation of fundamental ageing mechanisms will delay (in parallel) the appearance or severity of multiple chronic, non-communicable diseases, as these diseases share the same underlying risk factor - namely, ageing. In this context, cellular senescence has received considerable attention as a potential target in preventing or treating multiple age-related diseases and increasing healthspan. Here we review mechanisms of cellular senescence and approaches to target this pathway therapeutically using 'senolytic' drugs that kill senescent cells or inhibitors of the senescence-associated secretory phenotype (SASP). Furthermore, we highlight the evidence that cellular senescence has a causative role in multiple diseases associated with ageing. Finally, we focus on the role of cellular senescence in a number of endocrine diseases, including osteoporosis, metabolic syndrome and type 2 diabetes mellitus, as well as other endocrine conditions. Although much remains to be done, considerable preclinical evidence is now leading to the initiation of proof-of-concept clinical trials using senolytics for several endocrine and non-endocrine diseases."
  },
  "10.1155/2012/420637": {
    "title": "The Theory and Practice of Active Aging",
    "abstract": "\"Active aging\" connotes a radically nontraditional paradigm of aging which posits possible improvement in health despite increasing longevity. The new paradigm is based upon postponing functional declines more than mortality declines and compressing morbidity into a shorter period later in life. This paradigm (Compression of Morbidity) contrasts with the old, where increasing longevity inevitably leads to increasing morbidity. We have focused our research on controlled longitudinal studies of aging. The Runners and Community Controls study began at age 58 in 1984 and the Health Risk Cohorts study at age 70 in 1986. We noted that disability was postponed by 14 to 16 years in vigorous exercisers compared with controls and postponed by 10 years in low-risk cohorts compared with higher risk. Mortality was also postponed, but too few persons had died for valid comparison of mortality and morbidity. With the new data presented here, age at death at 30% mortality is postponed by 7 years in Runners and age at death at 50% (median) mortality by 3.3 years compared to controls. Postponement of disability is more than double that of mortality in both studies. These differences increase over time, occur in all subgroups, and persist after statistical adjustment."
  },
  "10.1038/s43587-021-00134-3": {
    "title": "Profiling epigenetic age in single cells",
    "abstract": "DNA methylation dynamics emerged as a promising biomarker of mammalian aging, with multivariate machine learning models ('epigenetic clocks') enabling measurement of biological age in bulk tissue samples. However, intrinsically sparse and binarized methylation profiles of individual cells have so far precluded the assessment of aging in single-cell data. Here, we introduce <i>scAge</i>, a statistical framework for epigenetic age profiling at single-cell resolution, and validate our approach in mice. Our method recapitulates the chronological age of tissues, while uncovering heterogeneity among cells. We show accurate tracking of the aging process in hepatocytes, demonstrate attenuated epigenetic aging in muscle stem cells, and track age dynamics in embryonic stem cells. We also use <i>scAge</i> to reveal, at the single-cell level, a natural and stratified rejuvenation event occurring during early embryogenesis. We provide our framework as a resource to enable exploration of epigenetic aging trajectories at single-cell resolution."
  },
  "10.1111/acel.14283": {
    "title": "Epistemic uncertainty challenges aging clock reliability in predicting rejuvenation effects",
    "abstract": "Epigenetic aging clocks have been widely used to validate rejuvenation effects during cellular reprogramming. However, these predictions are unverifiable because the true biological age of reprogrammed cells remains unknown. We present an analytical framework to consider rejuvenation predictions from the uncertainty perspective. Our analysis reveals that the DNA methylation profiles across reprogramming are poorly represented in the aging data used to train clock models, thus introducing high epistemic uncertainty in age estimations. Moreover, predictions of different published clocks are inconsistent, with some even suggesting zero or negative rejuvenation. While not questioning the possibility of age reversal, we show that the high clock uncertainty challenges the reliability of rejuvenation effects observed during in vitro reprogramming before pluripotency and throughout embryogenesis. Conversely, our method reveals a significant age increase after in vivo reprogramming. We recommend including uncertainty estimation in future aging clock models to avoid the risk of misinterpreting the results of biological age prediction."
  },
  "10.1097/GOX.0b013e31828ed1da": {
    "title": "The Science and Theory behind Facial Aging",
    "abstract": "The etiology of age-related facial changes has many layers. Multiple theories have been presented over the past 50-100 years with an evolution of understanding regarding facial changes related to skin, soft tissue, muscle, and bone. This special topic will provide an overview of the current literature and evidence and theories of facial changes of the skeleton, soft tissues, and skin over time."
  },
  "10.1093/gerona/glae210": {
    "title": "The Power of a Complex Systems Perspective to Elucidate Aging",
    "abstract": "It is becoming highly accepted that aging, age-related diseases, and geriatric healthcare can move forward if reductionist research is complemented by integrative research uniting knowledge on specific aging mechanisms, multiple biomedical, social, psychological, lifestyle, and environmental factors and their interactions. In this special issue, we present exciting papers that illustrate how complexity science theory and practice can be applied to aging research and provide a better understanding and quantification of healthy aging and vulnerability to disease. Recent insights on biomarkers, clocks of aging, frailty, and resilience are covered and studied in interaction with a dynamic multiscale perspective. The editorial and closing viewpoint guide you through basic principles of gerontological complexity science and shed light on new research horizons, including innovative systems-based interventions."
  },
  "10.5604/12321966.1129943": {
    "title": "Biological psychological and social determinants of old age: Bio-psycho-social aspects of human aging",
    "abstract": "The aging of humans is a physiological and dynamic process ongoing with time. In accordance with most gerontologists' assertions it starts in the fourth decade of life and leads to death. The process of human aging is complex and individualized, occurs in the biological, psychological and social sphere. Biological aging is characterized by progressive age-changes in metabolism and physicochemical properties of cells, leading to impaired self-regulation, regeneration, and to structural changes and functional tissues and organs. It is a natural and irreversible process which can run as successful aging, typical or pathological. Biological changes that occur with age in the human body affect mood, attitude to the environment, physical condition and social activity, and designate the place of seniors in the family and society. Psychical ageing refers to human awareness and his adaptability to the ageing process. Among adaptation attitudes we can differentiate: constructive, dependence, hostile towards others and towards self attitudes. With progressed age, difficulties with adjustment to the new situation are increasing, adverse changes in the cognitive and intellectual sphere take place, perception process involutes, perceived sensations and information received is lowered, and thinking processes change. Social ageing is limited to the role of an old person is culturally conditioned and may change as customs change. Social ageing refers to how a human being perceives the ageing process and how society sees it."
  },
  "10.1055/a-1761-8481": {
    "title": "The Aging Athlete: Paradigm of Healthy Aging",
    "abstract": "The Exercise Boom of the 1970's resulted in the adoption of habitual exercise in a significant portion of the population. Many of these individuals are defying the cultural norms by remaining physically active and competing at a high level in their later years. The juxtaposition between masters athletes and non-exercisers demonstrate the importance of remaining physically active throughout the lifespan on physiological systems related to healthspan (years of healthy living). This includes ~50% improved maximal aerobic capacity (VO<sub>2</sub>max) and enhanced skeletal muscle health (size, function, as well as metabolic and communicative properties) compared to non-exercisers at a similar age. By taking a reductionist approach to VO<sub>2</sub>max and skeletal muscle health, we can gain insight into how aging and habitual exercise affects the aging process. Collectively, this review provides a physiological basis for the elite performances seen in masters athletes, as well as the health implications of lifelong exercise with a focus on VO<sub>2</sub>max, skeletal muscle metabolic fitness, whole muscle size and function, single muscle fiber physiology, and communicative properties of skeletal muscle. This review has significant public health implications due to the potent health benefits of habitual exercise across the lifespan."
  },
  "10.1038/s41398-024-03004-9": {
    "title": "Trauma, adversity, and biological aging: behavioral mechanisms relevant to treatment and theory",
    "abstract": "Although stress and adversity are largely universal experiences, people exposed to greater hardship are at increased risk for negative health consequences. Recent studies identify accelerated biological aging as a mechanism that could explain how trauma and adversity gives rise to poor health, and advances in this area of study coincide with technological innovations in the measurement of biological aging, particularly epigenetic profiles consistent with accelerated aging derived from DNA methylation. In this review, we provide an overview of the current literature examining how adversity might accelerate biological aging, with a specific focus on social and health behaviors. The most extensive evidence in this area suggests that health-compromising behaviors, particularly smoking, may partially explain the association between adversity and accelerated aging. Although there is relatively less published support for the role of social behaviors, emerging evidence points to the importance of social connection as a mechanism for future study. Our review highlights the need to determine the extent to which the associations from adversity to accelerated aging are consistent with causal processes. As we consider these questions, the review emphasizes methodological approaches from the causal inference literature that can help deepen our understanding of how stress and trauma might result in poor health. The use of these methodologies will help provide evidence as to which behavioral interventions might slow aging and improve health, particularly among populations that more often experience adversity and trauma."
  },
  "10.1016/S0140-6736(13)61489-0": {
    "title": "Subjective wellbeing, health, and ageing",
    "abstract": "Subjective wellbeing and health are closely linked to age. Three aspects of subjective wellbeing can be distinguished-evaluative wellbeing (or life satisfaction), hedonic wellbeing (feelings of happiness, sadness, anger, stress, and pain), and eudemonic wellbeing (sense of purpose and meaning in life). We review recent advances in the specialty of psychological wellbeing, and present new analyses about the pattern of wellbeing across ages and the association between wellbeing and survival at older ages. The Gallup World Poll, a continuing survey in more than 160 countries, shows a U-shaped relation between evaluative wellbeing and age in high-income, English speaking countries, with the lowest levels of wellbeing in ages 45-54 years. But this pattern is not universal. For example, respondents from the former Soviet Union and eastern Europe show a large progressive reduction in wellbeing with age, respondents from Latin America also shows decreased wellbeing with age, whereas wellbeing in sub-Saharan Africa shows little change with age. The relation between physical health and subjective wellbeing is bidirectional. Older people with illnesses such as coronary heart disease, arthritis, and chronic lung disease show both increased levels of depressed mood and impaired hedonic and eudemonic wellbeing. Wellbeing might also have a protective role in health maintenance. In an analysis of the English Longitudinal Study of Ageing, we identify that eudemonic wellbeing is associated with increased survival; 29·3% of people in the lowest wellbeing quartile died during the average follow-up period of 8·5 years compared with 9·3% of those in the highest quartile. Associations were independent of age, sex, demographic factors, and baseline mental and physical health. We conclude that the wellbeing of elderly people is an important objective for both economic and health policy. Present psychological and economic theories do not adequately account for the variations in patterns of wellbeing with age across different parts of the world. The apparent association between wellbeing and survival is consistent with a protective role of high wellbeing, but alternative explanations cannot be ruled out at this stage."
  },
  "10.1007/s11904-010-0041-9": {
    "title": "HIV and Aging: Time for a New Paradigm",
    "abstract": "The population of patients with HIV infection achieving viral suppression on combination antiretroviral therapy is growing, aging, and experiencing a widening spectrum of non-AIDS diseases. Concurrently, AIDS-defining conditions are becoming less common and are variably associated with outcome. Nonetheless, the spectrum of disease experienced by those aging with HIV remains strongly influenced by HIV, its treatment, and the behaviors, conditions, and demographics associated with HIV infection. Our focus must shift from a narrow interest in CD4 counts, HIV-RNA, and AIDS-defining illnesses to determining the optimal management of HIV infection as a complex chronic disease in which the causes of morbidity and mortality are multiple and overlapping. We need a new paradigm of care with which to maximize functional status, minimize frailty, and prolong life expectancy. A composite index that summarizes a patient's risk of morbidity and mortality could facilitate this work and help chart its progress."
  },
  "10.18632/aging.206184": {
    "title": "Cell-type specific epigenetic clocks to quantify biological age at cell-type resolution",
    "abstract": "The ability to accurately quantify biological age could help monitor and control healthy aging. Epigenetic clocks have emerged as promising tools for estimating biological age, yet they have been developed from heterogeneous bulk tissues, and are thus composites of two aging processes, one reflecting the change of cell-type composition with age and another reflecting the aging of individual cell-types. There is thus a need to dissect and quantify these two components of epigenetic clocks, and to develop epigenetic clocks that can yield biological age estimates at cell-type resolution. Here we demonstrate that in blood and brain, approximately 39% and 12% of an epigenetic clock's accuracy is driven by underlying shifts in lymphocyte and neuronal subsets, respectively. Using brain and liver tissue as prototypes, we build and validate neuron and hepatocyte specific DNA methylation clocks, and demonstrate that these cell-type specific clocks yield improved estimates of chronological age in the corresponding cell and tissue-types. We find that neuron and glia specific clocks display biological age acceleration in Alzheimer's Disease with the effect being strongest for glia in the temporal lobe. Moreover, CpGs from these clocks display a small but significant overlap with the causal DamAge-clock, mapping to key genes implicated in neurodegeneration. The hepatocyte clock is found accelerated in liver under various pathological conditions. In contrast, non-cell-type specific clocks do not display biological age-acceleration, or only do so marginally. In summary, this work highlights the importance of dissecting epigenetic clocks and quantifying biological age at cell-type resolution."
  },
  "10.1177/0022034510377791": {
    "title": "Aging and Bone",
    "abstract": "Bones provide mechanical and protective function, while also serving as housing for marrow and a site for regulation of calcium ion homeostasis. The properties of bones do not remain constant with age; rather, they change throughout life, in some cases improving in function, but in others, function deteriorates. Here we review the modifications in the mechanical function and shape of bones, the bone cells, the matrix they produce, and the mineral that is deposited on this matrix, while presenting recent theories about the factors leading to these changes."
  },
  "10.1093/humrep/deg377": {
    "title": "Early ovarian ageing: a hypothesis: What is early ovarian ageing?",
    "abstract": "A concept of early ovarian ageing has been advanced. This theory suggests that some women will experience problems of fecundity at an early age given that the age of menopause is earlier for some women, and there is a fixed time of accelerated atresia leading up to menopause. Various components of this theory are examined based on existing literature. While the theory has merit, and is important to consider in terms of reproductive health, it remains a hypothesis. It is also plausible to consider that a segment of the population will have later ovarian ageing in that menopause can be as late as 58 years for some women. Further, it is not known whether there really is a fixed time of accelerated atresia leading up to menopause in all women. The practical considerations dealing with this hypothetical concern also are not trivial. How will certain women with early ovarian ageing be identified, what hormonal and other factors should be measured, and what advice is reasonable for these young women?"
  }
}