{
  "10.1016/j.exger.2010.09.007": {
    "title": "The reproductive-cell cycle theory of aging: An update",
    "abstract": "The Reproductive-Cell Cycle Theory posits that the hormones that regulate reproduction act in an antagonistic pleiotrophic manner to control aging via cell cycle signaling; promoting growth and development early in life in order to achieve reproduction, but later in life, in a futile attempt to maintain reproduction, become dysregulated and drive senescence. Since reproduction is the most important function of an organism from the perspective of the survival of the species, if reproductive-cell cycle signaling factors determine the rate of growth, determine the rate of development, determine the rate of reproduction, and determine the rate of senescence, then by definition they determine the rate of aging and thus lifespan. The theory is able to explain: 1) the simultaneous regulation of the rate of aging and reproduction as evidenced by the fact that environmental conditions and experimental interventions known to extend longevity are associated with decreased reproductive-cell cycle signaling factors, thereby slowing aging and preserving fertility in a hostile reproductive environment; 2) two phenomena that are closely related to species lifespan-the rate of growth and development and the ultimate size of the animal; 3). the apparent paradox that size is directly proportional to lifespan and inversely proportional to fertility between species but vice versa within a species; 4). how differing rates of reproduction between species is associated with differences in their lifespan; 5). why we develop aging-related diseases; and 6). an evolutionarily credible reason for why and how aging occurs-these hormones act in an antagonistic pleiotrophic manner via cell cycle signaling; promoting growth and development early in life in order to achieve reproduction, but later in life, in a futile attempt to maintain reproduction, become dysregulated and drive senescence (dyosis). In essence, the Reproductive-Cell Cycle Theory can explain aging in all sexually reproductive life forms."
  },
  "10.1038/s41556-025-01698-7": {
    "title": "An overview of contemporary theories of ageing",
    "abstract": "Ageing is a complex biological process whose underlying mechanisms remain contentious. Nonetheless, due to an ageing global population and the rising incidence of age-related diseases, understanding why we age is one of the most important scientific questions of our time, with profound medical implications. Here, I explore the fundamental nature of the ageing process and provide an overview of modern mechanistic theories. I critically examine two main groups of ageing theories: error-based and program-based theories. I discuss the relevance of these theories in the context of ageing patterns, genetic manipulations and longevity drugs, highlighting how experimental challenges and technological limitations have hindered progress. Overall, there is a pressing and unmet need for a robust theoretical framework in ageing research. Elucidating the cellular and molecular mechanisms of ageing would be crucial for developing effective interventions that slow the ageing process and prevent its associated diseases."
  },
  "10.1089/rej.2011.1162": {
    "title": "Developmental Theory of Aging Revisited: Focus on Causal and Mechanistic Links Between Development and Senescence",
    "abstract": "Senescence violates the most basic tenet of natural selection by causing death rather than individual survival. Thus, current theories favor the concept of antagonistic pleiotropy (AP) to explain how aging emerged in metazoans. Presumably, pleiotropic genes reduce vigor and limit longevity in adults. However, they also promote fitness and reproduction in juveniles, causing them to be selected and retained in the gene pool. The general hypothesis presented herein is a special case of AP that identifies the common cause and mechanism of aging in iteroparous (i.e., capable of reproducing multiple times) animals. It ascribes senescence to unremitting, nonprogrammed change or remodeling forced upon the adult soma by postmaturation expression of developmental gene(s) affecting dynamic transformation of the single-celled conceptus into a complex, multicellular organism. Whereas persistent somatic change is necessary for development to proceed normally, it also has the potential to erode homeostasis in adults after maturation is complete. Thus, developmental inertia is the primary cause of senescence, whereas decay of internal order and integrated function among interdependent systems of the body is the general mechanism by which aging progresses over time. Accordingly, this global pathogenic process creates an environment in which the many recognized, age-associated physiologic and metabolic sequelae can arise as consequences of senescence rather than causes of it. Paradoxically, the genes that promote somatic remodeling essential for development and survival also guarantee aging and death by the same action whose outcomes differ only by the time it is expressed relevant to maturation."
  },
  "10.1016/j.mad.2021.111583": {
    "title": "The tumor suppression theory of aging",
    "abstract": "Despite continued increases in human life expectancy, the factors determining the rate of human biological aging remain unknown. Without understanding the molecular mechanisms underlying aging, efforts to prevent aging are unlikely to succeed. The tumor suppression theory of aging introduced here proposes somatic mutation as the proximal cause of aging, but postulates that oncogenic transformation and clonal expansion, not functional impairment, are the relevant consequences of somatic mutation. Obesity and caloric restriction accelerate and decelerate aging due to their effect on cell proliferation, during which most mutations arise. Most phenotypes of aging are merely tumor-suppressive mechanisms that evolved to limit malignant growth, the dominant age-related cause of death in early and middle life. Cancer limits life span for most long-lived mammals, a phenomenon known as Peto's paradox. Its conservation across species demonstrates that mutation is a fundamental but hard limit on mammalian longevity. Cell senescence and apoptosis and differentiation induced by oncogenes, telomere shortening or DNA damage evolved as a second line of defense to limit the tumorigenic potential of clonally expanding cells, but accumulating senescent cells, senescence-associated secretory phenotypes and stem cell exhaustion eventually cause tissue dysfunction and the majority, if not most, phenotypes of aging."
  },
  "10.1042/CS20160897": {
    "title": "Redox theory of aging: implications for health and disease",
    "abstract": "Genetics ultimately defines an individual, yet the phenotype of an adult is extensively determined by the sequence of lifelong exposures, termed the exposome. The redox theory of aging recognizes that animals evolved within an oxygen-rich environment, which created a critical redox interface between an organism and its environment. Advances in redox biology show that redox elements are present throughout metabolic and structural systems and operate as functional networks to support the genome in adaptation to environmental resources and challenges during lifespan. These principles emphasize that physical and functional phenotypes of an adult are determined by gene-environment interactions from early life onward. The principles highlight the critical nature of cumulative exposure memories in defining changes in resilience progressively during life. Both plasma glutathione and cysteine systems become oxidized with aging, and the recent finding that cystine to glutathione ratio in human plasma predicts death in coronary artery disease (CAD) patients suggests this could provide a way to measure resilience of redox networks in aging and disease. The emerging concepts of cumulative gene-environment interactions warrant focused efforts to elucidate central mechanisms by which exposure memory governs health and etiology, onset and progression of disease."
  },
  "10.3389/fcell.2021.671208": {
    "title": "The Danaid Theory of Aging",
    "abstract": "The classical evolutionary theories of aging suggest that aging evolves due to insufficient selective pressure against it. In these theories, declining selection pressure with age leads to aging through genes or resource allocations, implying that aging could potentially be stalled were genes, resource allocation, or selection pressure somewhat different. While these classical evolutionary theories are undeniably part of a description of the evolution of aging, they do not explain the diversity of aging patterns, and they do not constitute the only possible evolutionary explanation. Without denying selection pressure a role in the evolution of aging, we argue that the origin and diversity of aging should also be sought in the nature and evolution of organisms that are, from their very physiological make up, unmaintainable. Drawing on advances in developmental biology, genetics, biochemistry, and complex systems theory since the classical theories emerged, we propose a fresh evolutionary-mechanistic theory of aging, the Danaid theory. We argue that, in complex forms of life like humans, various restrictions on maintenance and repair may be inherent, and we show how such restrictions are laid out during development. We further argue that there is systematic variation in these constraints across taxa, and that this is a crucial factor determining variation in aging and lifespan across the tree of life. Accordingly, the core challenge for the field going forward is to map and understand the mosaic of constraints, trade-offs, chance events, and selective pressures that shape aging in diverse ways across diverse taxa."
  },
  "10.1016/j.biosystems.2024.105157": {
    "title": "Dissipative scaling of development and aging in multicellular organisms",
    "abstract": "Evolution, self-replication and ontogenesis are highly dynamic, irreversible and self-organizing processes dissipating energy. While progress has been made to decipher the role of thermodynamics in cellular fission, it is not yet clear how entropic balances shape organism growth and aging. This paper derives a general dissipation theory for the life history of organisms. It implies a self-regulated energy dissipation facilitating exponential growth within a hierarchical and entropy lowering self-organization. The theory predicts ceilings in energy expenditures imposed by geometric constrains, which promote thermal optimality during development, and a dissipative scaling across organisms consistent with ecological scaling laws combining isometric and allometric terms. The theory also illustrates how growing organisms can tolerate damage through continuous extension and production of new dissipative structures low in entropy. However, when organisms reduce their rate of cell division and reach a steady adult state, they become thermodynamically unstable, increase internal entropy by accumulating damage, and age."
  },
  "10.1016/j.cell.2013.05.039": {
    "title": "The Hallmarks of Aging",
    "abstract": "Aging is characterized by a progressive loss of physiological integrity, leading to impaired function and increased vulnerability to death. This deterioration is the primary risk factor for major human pathologies, including cancer, diabetes, cardiovascular disorders, and neurodegenerative diseases. Aging research has experienced an unprecedented advance over recent years, particularly with the discovery that the rate of aging is controlled, at least to some extent, by genetic pathways and biochemical processes conserved in evolution. This Review enumerates nine tentative hallmarks that represent common denominators of aging in different organisms, with special emphasis on mammalian aging. These hallmarks are: genomic instability, telomere attrition, epigenetic alterations, loss of proteostasis, deregulated nutrient sensing, mitochondrial dysfunction, cellular senescence, stem cell exhaustion, and altered intercellular communication. A major challenge is to dissect the interconnectedness between the candidate hallmarks and their relative contributions to aging, with the final goal of identifying pharmaceutical targets to improve human health during aging, with minimal side effects."
  },
  "10.1038/s43587-023-00527-6": {
    "title": "The Information Theory of Aging",
    "abstract": "Information storage and retrieval is essential for all life. In biology, information is primarily stored in two distinct ways: the genome, comprising nucleic acids, acts as a foundational blueprint and the epigenome, consisting of chemical modifications to DNA and histone proteins, regulates gene expression patterns and endows cells with specific identities and functions. Unlike the stable, digital nature of genetic information, epigenetic information is stored in a digital-analog format, susceptible to alterations induced by diverse environmental signals and cellular damage. The Information Theory of Aging (ITOA) states that the aging process is driven by the progressive loss of youthful epigenetic information, the retrieval of which via epigenetic reprogramming can improve the function of damaged and aged tissues by catalyzing age reversal."
  },
  "10.1016/0022-5193(71)90091-9": {
    "title": "Codon-restriction theory of aging and development",
    "abstract": ""
  },
  "10.1073/pnas.2300624120": {
    "title": "A step toward precision gerontology: Lifespan effects of calorie and protein restriction are consistent with predicted impacts on entropy generation",
    "abstract": "Understanding aging is a key biological goal. Precision gerontology aims to predict how long individuals will live under different treatment scenarios. Calorie and protein restriction (CR and PR) extend lifespan in many species. Using data from C57BL/6 male mice under graded CR or PR, we introduce a computational thermodynamic model for entropy generation, which predicted the impact of the manipulations on lifespan. Daily entropy generation decreased significantly with increasing CR level, but not PR. Our predictions indicated the lifespan of CR mice should increase by 13 to 56% with 10 to 40% CR, relative to ad libitum-fed animals. This prediction was broadly consistent with the empirical observation of the lifespan impacts of CR in rodents. Modeling entropy fluxes may be a future strategy to identify antiaging interventions."
  },
  "10.1093/geront/34.6.756": {
    "title": "Re-engaging the Disengagement Theory of Aging: On the History and Assessment of Theory Development in Gerontology",
    "abstract": "While \"disengagement theory\" is today largely discounted, it has an important place in the history of gerontological explanation. First we analyze the historical context of this theory. Second, we examine its long-term contributions and deficiencies in terms of finer criteria--standards which we suggest should be used in evaluating current, and future, theories in social gerontology."
  },
  "10.1007/s10522-024-10143-5": {
    "title": "The evolution of ageing: classic theories and emerging ideas",
    "abstract": "Ageing is generally regarded as a non-adaptive by-product of evolution. Based on this premise three classic evolutionary theories of ageing have been proposed. These theories have dominated the literature for several decades. Despite their individual nuances, the common thread which unites them is that they posit that ageing results from a decline in the intensity of natural selection with chronological age. Empirical evidence has been identified which supports each theory. However, a consensus remains to be fully established as to which theory best accounts for the evolution of ageing. A consequence of this uncertainty are counter arguments which advocate for alternative theoretical frameworks, such as those which propose an adaptive origin for ageing, senescence, or death. Given this backdrop, this review has several aims. Firstly, to briefly discuss the classic evolutionary theories. Secondly, to evaluate how evolutionary forces beyond a monotonic decrease in natural selection can affect the evolution of ageing. Thirdly, to examine alternatives to the classic theories. Finally, to introduce a pluralistic interpretation of the evolution of ageing. The basis of this pluralistic theoretical framework is the recognition that certain evolutionary ideas will be more appropriate depending on the organism, its ecological context, and its life history."
  },
  "10.1152/physrev.1998.78.2.547": {
    "title": "The Free Radical Theory of Aging Matures",
    "abstract": "The free radical theory of aging, conceived in 1956, has turned 40 and is rapidly attracting the interest of the mainstream of biological research. From its origins in radiation biology, through a decade or so of dormancy and two decades of steady phenomenological research, it has attracted an increasing number of scientists from an expanding circle of fields. During the past decade, several lines of evidence have convinced a number of scientists that oxidants play an important role in aging. (For the sake of simplicity, we use the term oxidant to refer to all \"reactive oxygen species,\" including O2-., H2O2, and .OH, even though the former often acts as a reductant and produces oxidants indirectly.) The pace and scope of research in the last few years have been particularly impressive and diverse. The only disadvantage of the current intellectual ferment is the difficulty in digesting the literature. Therefore, we have systematically reviewed the status of the free radical theory, by categorizing the literature in terms of the various types of experiments that have been performed. These include phenomenological measurements of age-associated oxidative stress, interspecies comparisons, dietary restriction, the manipulation of metabolic activity and oxygen tension, treatment with dietary and pharmacological antioxidants, in vitro senescence, classical and population genetics, molecular genetics, transgenic organisms, the study of human diseases of aging, epidemiological studies, and the ongoing elucidation of the role of active oxygen in biology."
  },
  "10.1093/geront/29.2.183": {
    "title": "A Continuity Theory of Normal Aging",
    "abstract": "Continuity Theory holds that, in making adaptive choices, middle-aged and older adults attempt to preserve and maintain existing internal and external structures; and they prefer to accomplish this objective by using strategies tied to their past experiences of themselves and their social world. Change is linked to the person's perceived past, producing continuity in inner psychological characteristics as well as in social behavior and in social circumstances. Continuity is thus a grand adaptive strategy that is promoted by both individual preference and social approval."
  },
  "10.1016/j.cell.2005.01.027": {
    "title": "Understanding the Odd Science of Aging",
    "abstract": "Evolutionary considerations suggest aging is caused not by active gene programming but by evolved limitations in somatic maintenance, resulting in a build-up of damage. Ecological factors such as hazard rates and food availability influence the trade-offs between investing in growth, reproduction, and somatic survival, explaining why species evolved different life spans and why aging rate can sometimes be altered, for example, by dietary restriction. To understand the cell and molecular basis of aging is to unravel the multiplicity of mechanisms causing damage to accumulate and the complex array of systems working to keep damage at bay."
  },
  "10.1007/s10522-015-9584-x": {
    "title": "Complex systems dynamics in aging: new evidence, continuing questions",
    "abstract": "There have long been suggestions that aging is tightly linked to the complex dynamics of the physiological systems that maintain homeostasis, and in particular to dysregulation of regulatory networks of molecules. This review synthesizes recent work that is starting to provide evidence for the importance of such complex systems dynamics in aging. There is now clear evidence that physiological dysregulation--the gradual breakdown in the capacity of complex regulatory networks to maintain homeostasis--is an emergent property of these regulatory networks, and that it plays an important role in aging. It can be measured simply using small numbers of biomarkers. Additionally, there are indications of the importance during aging of emergent physiological processes, functional processes that cannot be easily understood through clear metabolic pathways, but can nonetheless be precisely quantified and studied. The overall role of such complex systems dynamics in aging remains an important open question, and to understand it future studies will need to distinguish and integrate related aspects of aging research, including multi-factorial theories of aging, systems biology, bioinformatics, network approaches, robustness, and loss of complexity."
  },
  "10.1152/physrev.00047.2006": {
    "title": "Life and Death: Metabolic Rate, Membrane Composition, and Life Span of Animals",
    "abstract": "Maximum life span differences among animal species exceed life span variation achieved by experimental manipulation by orders of magnitude. The differences in the characteristic maximum life span of species was initially proposed to be due to variation in mass-specific rate of metabolism. This is called the rate-of-living theory of aging and lies at the base of the oxidative-stress theory of aging, currently the most generally accepted explanation of aging. However, the rate-of-living theory of aging while helpful is not completely adequate in explaining the maximum life span. Recently, it has been discovered that the fatty acid composition of cell membranes varies systematically between species, and this underlies the variation in their metabolic rate. When combined with the fact that 1) the products of lipid peroxidation are powerful reactive molecular species, and 2) that fatty acids differ dramatically in their susceptibility to peroxidation, membrane fatty acid composition provides a mechanistic explanation of the variation in maximum life span among animal species. When the connection between metabolic rate and life span was first proposed a century ago, it was not known that membrane composition varies between species. Many of the exceptions to the rate-of-living theory appear explicable when the particular membrane fatty acid composition is considered for each case. Here we review the links between metabolic rate and maximum life span of mammals and birds as well as the linking role of membrane fatty acid composition in determining the maximum life span. The more limited information for ectothermic animals and treatments that extend life span (e.g., caloric restriction) are also reviewed."
  },
  "10.1016/j.metabol.2025.156158": {
    "title": "Metabolaging: a new geroscience perspective linking aging pathologies and metabolic dysfunction",
    "abstract": "With age, our metabolic systems undergo significant alterations, which can lead to a cascade of adverse effects that are implicated in both metabolic disorders, such as diabetes, and in the body's ability to respond to acute stress and trauma. To elucidate the metabolic imbalances arising from aging, we introduce the concept of \"metabolaging.\" This framework encompasses the broad spectrum of metabolic disruptions associated with the hallmarks of aging, including the functional decline of key metabolically active organs, like the adipose tissue. By examining how these organs interact with essential nutrient-sensing pathways, \"metabolaging\" provides a more comprehensive view of the systemic metabolic imbalances that occur with age. This concept extends to understanding how age-related metabolic disturbances can influence the response to acute stressors, like burn injuries, highlighting the interplay between metabolic dysfunction and the ability to handle severe physiological challenges. Finally, we propose potential interventions that hold promise in mitigating the effects of metabolaging and its downstream consequences."
  },
  "10.1093/geront/4.4.195": {
    "title": "The Immunologic Theory of Aging",
    "abstract": ""
  },
  "10.1006/jtbi.2001.2296": {
    "title": "Patterns of Age-specific Means and Genetic Variances of Mortality Rates Predicted by the Mutation-Accumulation Theory of Ageing",
    "abstract": "A general quantitative genetic model of mutations with age-specific deleterious effects is developed. It is shown that, for the simplest case of a species with age-independent reproductive rates and extrinsic adult mortality rates, and no pleiotropic effects of age-specific mutations, exponential increases with age of both the mean and additive genetic variance of age-specific mortality rates are expected. Models where age-specific mutations have pleiotropic effects on mortality that extend either throughout adult life, or are confined to juvenile stages, produce equilibria with exponential increases in the mean and additive variance of mortality rates during much of adult life. However, the rates of increase diminish late in life, and can even become zero. Predictions concerning the additive genetic correlations in mortality rates between different ages are also developed. The predictions of the models are compared with data on humans and Drosophila."
  },
  "10.1016/j.arr.2021.101557": {
    "title": "The hyperfunction theory: An emerging paradigm for the biology of aging",
    "abstract": "The process of senescence (aging) is predominantly determined by the action of wild-type genes. For most organisms, this does not reflect any adaptive function that senescence serves, but rather evolutionary effects of declining selection against genes with deleterious effects later in life. To understand aging requires an account of how evolutionary mechanisms give rise to pathogenic gene action and late-life disease, that integrates evolutionary (ultimate) and mechanistic (proximate) causes into a single explanation. A well-supported evolutionary explanation by G.C. Williams argues that senescence can evolve due to pleiotropic effects of alleles with antagonistic effects on fitness and late-life health (antagonistic pleiotropy, AP). What has remained unclear is how gene action gives rise to late-life disease pathophysiology. One ultimate-proximate account is T.B.L. Kirkwood's disposable soma theory. Based on the hypothesis that stochastic molecular damage causes senescence, this reasons that aging is coupled to reproductive fitness due to preferential investment of resources into reproduction, rather than somatic maintenance. An alternative and more recent ultimate-proximate theory argues that aging is largely caused by programmatic, developmental-type mechanisms. Here ideas about AP and programmatic aging are reviewed, particularly those of M.V. Blagosklonny (the hyperfunction theory) and J.P. de Magalhães (the developmental theory), and their capacity to make sense of diverse experimental findings is assessed."
  },
  "10.3390/cells11050917": {
    "title": "A Mechanistic Theory of Development-Aging Continuity in Humans and Other Mammals",
    "abstract": "There is consensus among biogerontologists that aging occurs either as the result of a purposeful genome-based, evolved program or due to spontaneous, randomly occurring, maladaptive events. Neither concept has yet identified a specific mechanism to explain aging's emergence and acceleration during mid-life and beyond. Presented herein is a novel, unifying mechanism with empirical evidence that describes how aging becomes continuous with development. It assumes that aging emerges from deterioration of a regulatory process that directs morphogenesis and morphostasis. The regulatory system consists of a genome-wide \"backbone\" within which its specific genes are differentially expressed by the local epigenetic landscapes of cells and tissues within which they reside, thereby explaining its holistic nature. Morphostasis evolved in humans to ensure the nurturing of dependent offspring during the first decade of young adulthood when peak parental vitality prevails in the absence of aging. The strict redundancy of each morphostasis regulatory cycle requires sensitive dependence upon initial conditions to avoid initiating deterministic chaos behavior. However, when natural selection declines as midlife approaches, persistent, progressive, and specific DNA damage and misrepair changes the initial conditions of the regulatory process, thereby compromising morphostasis regulatory redundancy, instigating chaos, initiating senescence, and accelerating aging thereafter."
  },
  "10.1038/s41576-018-0004-3": {
    "title": "DNA methylation-based biomarkers and the epigenetic clock theory of ageing",
    "abstract": "Identifying and validating molecular targets of interventions that extend the human health span and lifespan has been difficult, as most clinical biomarkers are not sufficiently representative of the fundamental mechanisms of ageing to serve as their indicators. In a recent breakthrough, biomarkers of ageing based on DNA methylation data have enabled accurate age estimates for any tissue across the entire life course. These 'epigenetic clocks' link developmental and maintenance processes to biological ageing, giving rise to a unified theory of life course. Epigenetic biomarkers may help to address long-standing questions in many fields, including the central question: why do we age?"
  },
  "10.3390/vaccines12121314": {
    "title": "Immunosenescence: Aging and Immune System Decline",
    "abstract": "Immunosenescence, a systematic reduction in the immune system connected with age, profoundly affects the health and well-being of elderly individuals. This review outlines the hallmark features of immunosenescence, including thymic involution, inflammaging, cellular metabolic adaptations, and hematopoietic changes, and their impact on immune cells such as macrophages, neutrophils, T cells, dendritic cells, B cells, and natural killer (NK) cells. Thymic involution impairs the immune system's capacity to react to novel antigens by reducing thymopoiesis and shifting toward memory T cells. Inflammaging, characterized by chronic systemic inflammation, further impairs immune function. Cellular metabolic adaptations and hematopoietic changes alter immune cell function, contributing to a diminished immune response. Developing ways to reduce immunosenescence and enhance immunological function in the elderly population requires an understanding of these mechanisms."
  },
  "10.1038/s43587-024-00716-x": {
    "title": "The brain–body energy conservation model of aging",
    "abstract": "Aging involves seemingly paradoxical changes in energy metabolism. Molecular damage accumulation increases cellular energy expenditure, yet whole-body energy expenditure remains stable or decreases with age. We resolve this apparent contradiction by positioning the brain as the mediator and broker in the organismal energy economy. As somatic tissues accumulate damage over time, costly intracellular stress responses are activated, causing aging or senescent cells to secrete cytokines that convey increased cellular energy demand (hypermetabolism) to the brain. To conserve energy in the face of a shrinking energy budget, the brain deploys energy conservation responses, which suppress low-priority processes, producing fatigue, physical inactivity, blunted sensory capacities, immune alterations and endocrine 'deficits'. We term this cascade the brain-body energy conservation (BEC) model of aging. The BEC outlines (1) the energetic cost of cellular aging, (2) how brain perception of senescence-associated hypermetabolism may drive the phenotypic manifestations of aging and (3) energetic principles underlying the modifiability of aging trajectories by stressors and geroscience interventions."
  },
  "10.1080/15384101.2022.2054636": {
    "title": "Cell senescence, rapamycin and hyperfunction theory of aging",
    "abstract": "A hallmark of cellular senescence is proliferation-like activity of growth-promoting pathways (such as mTOR and MAPK) in non-proliferating cells. When the cell cycle is arrested, these pathways convert arrest to senescence (geroconversion), rendering cells hypertrophic, beta-Gal-positive and hyperfunctional. The senescence-associated secretory phenotype (SASP) is one of the numerous hyperfunctions. Figuratively, geroconversion is a continuation of growth in non-proliferating cells. Rapamycin, a reversible inhibitor of growth, slows down mTOR-driven geroconversion. Developed two decades ago, this model had accurately predicted that rapamycin must extend life span of animals. However, the notion that senescent cells directly cause organismal aging is oversimplified. Senescent cells contribute to organismal aging but are not strictly required. Cell senescence and organismal aging can be linked indirectly via the same underlying cause, namely hyperfunctional signaling pathways such as mTOR."
  },
  "10.1016/B978-0-12-394625-6.00001-5": {
    "title": "The Mitochondrial Free Radical Theory of Aging",
    "abstract": "The mitochondrial free radical theory of aging is reviewed. Only two parameters currently correlate with species longevity in the right sense: the mitochondrial rate of reactive oxygen species (mitROS) production and the degree of fatty acid unsaturation of tissue membranes. Both are low in long-lived animals. In addition, the best-known manipulation that extends longevity, dietary restriction, also decreases the rate of mitROS production and oxidative damage to mtDNA. The same occurs during protein restriction as well as during methionine restriction. These two manipulations also increase maximum longevity in rodents. The decrease in mitROS generation and oxidative stress that takes place in caloric restriction seems to be due to restriction of a single dietary substance: methionine. The information available supports a mitochondrial free radical theory of aging focused on low generation of endogenous damage and low sensitivity of membranes to oxidation in long-lived animals."
  }
}